{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "%": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "@": 22,
      "B": 23,
      "C": 24,
      "F": 25,
      "H": 26,
      "I": 27,
      "N": 28,
      "O": 29,
      "P": 30,
      "S": 31,
      "[": 32,
      "]": 33,
      "c": 34,
      "e": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "r": 40,
      "s": 41,
      "))": 42,
      "CC": 43,
      "))))": 44,
      "cc": 45,
      "O)": 46,
      "=O)": 47,
      "[C": 48,
      "[C@": 49,
      "H]": 50,
      "C=O)": 51,
      "))))))))": 52,
      "[C@H]": 53,
      "[C@@": 54,
      "C)": 55,
      "NC=O)": 56,
      "[C@@H]": 57,
      "CCC": 58,
      "C=O)N": 59,
      "cccc": 60,
      "))))))": 61,
      ")C": 62,
      "CCCC": 63,
      "cn": 64,
      "C[C@H]": 65,
      "F)": 66,
      "C[C@@H]": 67,
      "CNC=O)": 68,
      "CO": 69,
      "ccc": 70,
      "=O)N": 71,
      "6))))))))": 72,
      "CN": 73,
      "CCNC=O)": 74,
      "cc6": 75,
      ")))))))": 76,
      "CC=O)N": 77,
      "CCO": 78,
      "c5": 79,
      "C)C": 80,
      "c6": 81,
      "))))))))))": 82,
      "ccn": 83,
      "C=": 84,
      "[n": 85,
      "[nH]": 86,
      "CC[C@H]": 87,
      "n5": 88,
      "C5": 89,
      "Cl": 90,
      "CCN": 91,
      "F)F": 92,
      "CCC)": 93,
      "CC[C@@H]": 94,
      ")))))": 95,
      "CC6": 96,
      ")))": 97,
      "CC)": 98,
      "[C@]": 99,
      "Ccccc": 100,
      "=O": 101,
      ")))))))))": 102,
      "C4": 103,
      "[C@@]": 104,
      "CCCNC=O)": 105,
      "Cl)": 106,
      ")))))))C": 107,
      "O=": 108,
      "CC3": 109,
      "cnc": 110,
      "CCCCC": 111,
      "C6": 112,
      "CCC3": 113,
      "5))))))))": 114,
      "CCC=O)N": 115,
      "OC": 116,
      "[C@H]C)": 117,
      "nn": 118,
      ")C4": 119,
      "CCCN": 120,
      "C#": 121,
      "[C@@H]C)": 122,
      "cccccc6": 123,
      "Br": 124,
      "Cccc": 125,
      "CC)C": 126,
      "C)C=O)": 127,
      "CS": 128,
      "s5": 129,
      "CCC[C@H]": 130,
      "cccn": 131,
      "CC=": 132,
      "ccccc": 133,
      ")C5": 134,
      "C=O)NC[C@H]": 135,
      "C=O)N[C@H]": 136,
      "5C": 137,
      "nc": 138,
      "CCCO": 139,
      "F)F)F": 140,
      "C=O)NC[C@@H]": 141,
      "CCC[C@@H]": 142,
      "CC6))))))))": 143,
      ")))))))))))": 144,
      "CCC4": 145,
      "CO))": 146,
      "5C=O)": 147,
      "C=O)N[C@@H]": 148,
      "o5": 149,
      "Br)": 150,
      "O=CN": 151,
      "CC)C)C": 152,
      "ccc6": 153,
      "Ccn": 154,
      "nn5": 155,
      "ccnc": 156,
      "CCS": 157,
      "))))))))))))": 158,
      "C=O)NCCCC": 159,
      "NC=O)[C@@H]": 160,
      "CC))": 161,
      "%1": 162,
      "6))))))))))": 163,
      "C[C@]": 164,
      "cc5": 165,
      ")C6": 166,
      "NC=O)[C@H]": 167,
      "c5C": 168,
      "%10": 169,
      "Ccc": 170,
      "CC)C)": 171,
      "nc6": 172,
      "cC)": 173,
      "C[C@@]": 174,
      "C=O)NCC": 175,
      "N)": 176,
      "CCC)C)": 177,
      "OC))": 178,
      "CCCC=O)N": 179,
      "6)))))))))": 180,
      "C[C@H]3": 181,
      "[N": 182,
      "C=O)NC)": 183,
      "ncc": 184,
      "=O)=O)": 185,
      "6C": 186,
      "6C=O)": 187,
      "CCCC4": 188,
      "c9": 189,
      "[nH]5": 190,
      "+]": 191,
      "-]": 192,
      "n6": 193,
      "CNC=O)[C@@H]": 194,
      "CC5": 195,
      "C/": 196,
      "ncn": 197,
      "C[C@@H]3": 198,
      "CNC=O)[C@H]": 199,
      "[N+]": 200,
      "CF)F)F": 201,
      "ccnn": 202,
      "NC=O)cccc": 203,
      "C7": 204,
      "C#N": 205,
      ")=O": 206,
      "[C@]C)": 207,
      "=O)=O": 208,
      "C[C@H]5": 209,
      "C=O)NCCNC=O)": 210,
      "CCOC5": 211,
      "CCCC5": 212,
      "cs": 213,
      "CCCC3": 214,
      "nc5": 215,
      "F)C": 216,
      "COC=O)": 217,
      "c6))))))))": 218,
      "sc5": 219,
      ")))))))C5": 220,
      "cc6))))))))": 221,
      "C=O)NCC[C@H]": 222,
      "c[nH]": 223,
      "Ccnc": 224,
      "CC7": 225,
      "cncc": 226,
      ")))))))C4": 227,
      "=N": 228,
      "NC=O)ccc": 229,
      "[C@@]C)": 230,
      "[O": 231,
      "[O-]": 232,
      "C[C@H]C)": 233,
      "CCC)C": 234,
      "CF)F": 235,
      "NC)C=O)": 236,
      "cccc6": 237,
      "cn6": 238,
      "C[C@@H]C)": 239,
      "CNC)C=O)": 240,
      "cn5": 241,
      "F)c6": 242,
      "))))))C5": 243,
      "ccs": 244,
      "[C@@H]CNC=O)": 245,
      "CCC3)))": 246,
      "C=O)NCC[C@@H]": 247,
      "=O)[O-]": 248,
      "[N+]=O)[O-]": 249,
      "C#N))": 250,
      "ccc5": 251,
      "CCNC=O)[C@@H]": 252,
      "NC)C": 253,
      "Ccccccc6": 254,
      "cCl)": 255,
      "CCNC=O)[C@H]": 256,
      "CN)=O": 257,
      "[C@H]6": 258,
      "CNC)": 259,
      "Cccn": 260,
      "ccccF)": 261,
      "CCC[C@H]5": 262,
      "C=C/": 263,
      "CCCC)": 264,
      "))))))C4": 265,
      ")))))))))))))": 266,
      "CC=O)N[C@H]": 267,
      "C[C@H]O)": 268,
      "S=O)=O)": 269,
      "cc[nH]": 270,
      "C[C@H]NC=O)": 271,
      "C=O)NCCC": 272,
      "CNC=O)cccc": 273,
      "C[C@@H]NC=O)": 274,
      "n5C": 275,
      "C=O)NCCO": 276,
      "CCF)F": 277,
      "CCCCN": 278,
      "C[C@@H]O)": 279,
      "C)c": 280,
      "[C@H]5": 281,
      "[C@@H]6": 282,
      "oc5": 283,
      ")))))C": 284,
      "CNC=O)ccc": 285,
      "O5": 286,
      "C6))))))))": 287,
      "COcccc": 288,
      "))))))))))))))": 289,
      "CCCN5C=O)": 290,
      ")))))))N": 291,
      "CCC[C@@H]5": 292,
      "CCCCC6": 293,
      "9))))))))))": 294,
      "F)F)": 295,
      "Cccccc": 296,
      "CF)F)F))": 297,
      "))))))N": 298,
      "co": 299,
      "C[C@H]6": 300,
      "[nH]c5": 301,
      "CC=O)": 302,
      "))))))))C5": 303,
      ")))))))))C": 304,
      "ccC)": 305,
      "CCcccc": 306,
      ")))))C4": 307,
      ")))))))C6": 308,
      "C[C@H]CNC=O)": 309,
      "CC[C@H]C)": 310,
      "CC[C@H]6": 311,
      ")))))))CC6": 312,
      "cc6F": 313,
      "C[C@@H]CNC=O)": 314,
      "CCCCO": 315,
      "nC)": 316,
      "C[C@@H]5": 317,
      "[N+]=O)[O-]))": 318,
      ")))))C5": 319,
      "Cnn": 320,
      "=O)=O)N": 321,
      "NC=O)C=": 322,
      "C)=O)=O": 323,
      "))))))))C4": 324,
      "C=O)NCCCNC=O)": 325,
      "CC=O)N[C@@H]": 326,
      "[C@H]CNC=O)": 327,
      "CCC)C)C": 328,
      "COccc": 329,
      "[nH]n5": 330,
      "CCN6C=O)": 331,
      "nccn": 332,
      "CC)C))": 333,
      "ccccCl)": 334,
      "ccCl)": 335,
      "#N": 336,
      "))))C4": 337,
      "CCCCC5": 338,
      "CCO6": 339,
      "/C=C/": 340,
      "CCCS": 341,
      "[C@@H]5": 342,
      "C)c5": 343,
      "[C@H]O)": 344,
      "C6)))))))": 345,
      "N5C=O)": 346,
      "on5": 347,
      "N=": 348,
      "CC=O)NC[C@H]": 349,
      "CCC6": 350,
      "F)c": 351,
      "))C4": 352,
      "CC[C@]": 353,
      "cco": 354,
      "CCCCNC=O)": 355,
      "COC": 356,
      ")))))))))))))))": 357,
      "CCccc": 358,
      "))))))CC6": 359,
      "cccnc": 360,
      "CCC5": 361,
      "))))))))))))))))": 362,
      "CC=O)NC)": 363,
      "CCCO5": 364,
      "CC[C@@]": 365,
      "CCNC)C=O)": 366,
      "CC=O)NC[C@@H]": 367,
      ")))C4": 368,
      "CCcn": 369,
      "CCNC=O)ccc": 370,
      "CO[C@H]": 371,
      "CCCCC4": 372,
      "C[C@@H]6": 373,
      ")))))))))C4": 374,
      "))))C5": 375,
      "))C5": 376,
      "CCNC=O)cccc": 377,
      "cc6Cl": 378,
      "cs5": 379,
      "CCC=": 380,
      "CCF)F)F": 381,
      "CC[C@@H]C)": 382,
      "-cccc": 383,
      "[C@@H]O)": 384,
      "CF)F))": 385,
      "OCC)C)C": 386,
      "s5))))))))": 387,
      "Cncc": 388,
      "C[C@]C)": 389,
      "CC)=O": 390,
      "SC)=O)=O": 391,
      "CC6)))))))": 392,
      "Ccccn": 393,
      "ccF)": 394,
      "cn[nH]": 395,
      ")))C": 396,
      "Cn": 397,
      "CCCC)C)": 398,
      "))))))C6": 399,
      "Cccnc": 400,
      ")))))))))C5": 401,
      "C[C@@]C)": 402,
      "no5": 403,
      "Cccs": 404,
      ")))C5": 405,
      "cccCl)": 406,
      "C=O)N[C@H]C)": 407,
      "O)CNC=O)": 408,
      "CCF": 409,
      "[C@H]NC=O)": 410,
      "c6F": 411,
      "))))))))))C4": 412,
      "CO[C@@H]": 413,
      "CC[C@H]4": 414,
      "CCOCC6": 415,
      "CCNC)": 416,
      "cnnn": 417,
      "cc6C": 418,
      ")))))N": 419,
      "cccccc": 420,
      "CCOC=O)": 421,
      "CCCNC=O)[C@@H]": 422,
      "CCnn": 423,
      "NC=O)N": 424,
      "CN5C=O)": 425,
      "CN=": 426,
      "SC": 427,
      "95": 428,
      "c6C": 429,
      "CNC)C": 430,
      "C=O)N[C@@H]C)": 431,
      "))))))))))C5": 432,
      "CC6)))))))))": 433,
      "CF)": 434,
      "ccncc": 435,
      "S=O)=O)N": 436,
      "=N)": 437,
      "C=N": 438,
      "cnc5": 439,
      "CCCNC=O)[C@H]": 440,
      "C=CCCC": 441,
      "C)C6": 442,
      "cO)": 443,
      "ccnnC)c5": 444,
      "CCCC[C@H]6": 445,
      "CCl": 446,
      "N#": 447,
      "CCOC": 448,
      ")))))C6": 449,
      "nnc5": 450,
      "CC[C@@H]6": 451,
      "o5))))))))": 452,
      "C=O)O": 453,
      "))CC3": 454,
      "C)C)": 455,
      "CCCCC))": 456,
      "CN)=O))": 457,
      "ccsc": 458,
      "CC[C@H]CNC=O)": 459,
      "CCNC)C": 460,
      "CCcnc": 461,
      "N)=O)=O": 462,
      "cccC)": 463,
      "n9": 464,
      "CCO)))": 465,
      "[nH]c": 466,
      "nccnc5": 467,
      "nc5C": 468,
      "CCCC[C@@H]6": 469,
      "cF)c6": 470,
      "C=O)NCCN": 471,
      "[C@H]5C": 472,
      "Ccncc": 473,
      "[S": 474,
      "[C@@H]NC=O)": 475,
      "CC6))))))))))": 476,
      "cncn": 477,
      "CCNC=O)C=": 478,
      ")))))))))))))))))": 479,
      ")Cl": 480,
      "4C=O)": 481,
      "C=O)NCCC[C@H]": 482,
      ")))))CC6": 483,
      "CCCCCC6": 484,
      "CC[C@H]NC=O)": 485,
      "C8": 486,
      "CCN5C=O)": 487,
      "CNC=O)C=": 488,
      "cnc6": 489,
      "CCC)C)O": 490,
      "CF": 491,
      "6)))))))))))": 492,
      "C5=O": 493,
      "))))))))C6": 494,
      "[C@H]6C": 495,
      "CCC)C)))": 496,
      "CCO)": 497,
      "N[C@H]": 498,
      "@]": 499
    },
    "merges": [
      ") )",
      "C C",
      ")) ))",
      "c c",
      "O )",
      "= O)",
      "[ C",
      "[C @",
      "H ]",
      "C =O)",
      ")))) ))))",
      "[C@ H]",
      "[C@ @",
      "C )",
      "N C=O)",
      "[C@@ H]",
      "CC C",
      "C=O) N",
      "cc cc",
      ")))) ))",
      ") C",
      "CC CC",
      "c n",
      "C [C@H]",
      "F )",
      "C [C@@H]",
      "C NC=O)",
      "C O",
      "cc c",
      "=O) N",
      "6 ))))))))",
      "C N",
      "CC NC=O)",
      "cc 6",
      ")))))) )",
      "CC =O)N",
      "CC O",
      "c 5",
      "C) C",
      "c 6",
      ")))))))) ))",
      "cc n",
      "C =",
      "[ n",
      "[n H]",
      "CC [C@H]",
      "n 5",
      "C 5",
      "C l",
      "CC N",
      "F) F",
      "CC C)",
      "CC [C@@H]",
      ")))) )",
      "CC 6",
      ")) )",
      "CC )",
      "[C@ ]",
      "C cccc",
      "= O",
      ")))))))) )",
      "C 4",
      "[C@@ ]",
      "CCC NC=O)",
      "Cl )",
      ")))))) )C",
      "O =",
      "CC 3",
      "cn c",
      "CC CCC",
      "C 6",
      "CCC 3",
      "5 ))))))))",
      "CC C=O)N",
      "O C",
      "[C@H] C)",
      "n n",
      ")C 4",
      "CCC N",
      "C #",
      "[C@@H] C)",
      "cccc cc6",
      "B r",
      "C ccc",
      "CC )C",
      "C) C=O)",
      "C S",
      "s 5",
      "CCC [C@H]",
      "cc cn",
      "CC =",
      "cccc c",
      ")C 5",
      "C=O)N C[C@H]",
      "C=O)N [C@H]",
      "5 C",
      "n c",
      "CCC O",
      "F) F)F",
      "C=O)N C[C@@H]",
      "CCC [C@@H]",
      "CC 6))))))))",
      ")))))))))) )",
      "CCC 4",
      "CO ))",
      "5 C=O)",
      "C=O)N [C@@H]",
      "o 5",
      "Br )",
      "O= CN",
      "CC) C)C",
      "ccc 6",
      "C cn",
      "n n5",
      "ccn c",
      "CC S",
      ")))))))) ))))",
      "C=O)N CCCC",
      "NC=O) [C@@H]",
      "CC ))",
      "% 1",
      "6)))))))) ))",
      "C [C@]",
      "cc 5",
      ")C 6",
      "NC=O) [C@H]",
      "c5 C",
      "%1 0",
      "C cc",
      "CC) C)",
      "n c6",
      "c C)",
      "C [C@@]",
      "C=O)N CC",
      "N )",
      "CCC) C)",
      "OC ))",
      "CCCC =O)N",
      "6)))))))) )",
      "C[C@H] 3",
      "[ N",
      "C=O)N C)",
      "n cc",
      "=O) =O)",
      "6 C",
      "6 C=O)",
      "CCCC 4",
      "c 9",
      "[nH] 5",
      "+ ]",
      "- ]",
      "n 6",
      "CNC=O) [C@@H]",
      "CC 5",
      "C /",
      "n cn",
      "C[C@@H] 3",
      "CNC=O) [C@H]",
      "[N +]",
      "C F)F)F",
      "ccn n",
      "NC=O) cccc",
      "C 7",
      "C# N",
      ") =O",
      "[C@] C)",
      "=O) =O",
      "C[C@H] 5",
      "C=O)N CCNC=O)",
      "CCO C5",
      "CCCC 5",
      "c s",
      "CCCC 3",
      "n c5",
      "F )C",
      "CO C=O)",
      "c 6))))))))",
      "s c5",
      ")))))))C 5",
      "cc 6))))))))",
      "C=O)N CC[C@H]",
      "c [nH]",
      "C cnc",
      "CC 7",
      "cn cc",
      ")))))))C 4",
      "= N",
      "NC=O) ccc",
      "[C@@] C)",
      "[ O",
      "[O -]",
      "C[C@H] C)",
      "CC C)C",
      "C F)F",
      "N C)C=O)",
      "cccc 6",
      "cn 6",
      "C[C@@H] C)",
      "CN C)C=O)",
      "cn 5",
      "F) c6",
      ")))))) C5",
      "cc s",
      "[C@@H] CNC=O)",
      "CCC3 )))",
      "C=O)N CC[C@@H]",
      "=O) [O-]",
      "[N+] =O)[O-]",
      "C#N ))",
      "ccc 5",
      "CCNC=O) [C@@H]",
      "N C)C",
      "Ccccc cc6",
      "c Cl)",
      "CCNC=O) [C@H]",
      "CN )=O",
      "[C@H] 6",
      "CN C)",
      "C ccn",
      "cccc F)",
      "CCC[C@H] 5",
      "C= C/",
      "CCCC )",
      ")))))) C4",
      ")))))))) )))))",
      "CC=O)N [C@H]",
      "C[C@H] O)",
      "S =O)=O)",
      "cc [nH]",
      "C[C@H] NC=O)",
      "C=O)N CCC",
      "CNC=O) cccc",
      "C[C@@H] NC=O)",
      "n5 C",
      "C=O)N CCO",
      "CC F)F",
      "CCCC N",
      "C[C@@H] O)",
      "C) c",
      "[C@H] 5",
      "[C@@H] 6",
      "o c5",
      ")))) )C",
      "CNC=O) ccc",
      "O 5",
      "C 6))))))))",
      "CO cccc",
      ")))))))) ))))))",
      "CCCN 5C=O)",
      "))))))) N",
      "CCC[C@@H] 5",
      "CCCCC 6",
      "9 ))))))))))",
      "F) F)",
      "Ccccc c",
      "CF)F)F ))",
      ")))))) N",
      "c o",
      "C[C@H] 6",
      "[nH] c5",
      "CC =O)",
      ")))))))) C5",
      ")))))))) )C",
      "cc C)",
      "CC cccc",
      ")))) )C4",
      ")))))))C 6",
      "C[C@H] CNC=O)",
      "CC[C@H] C)",
      "CC[C@H] 6",
      "))))))) CC6",
      "cc6 F",
      "C[C@@H] CNC=O)",
      "CCCC O",
      "n C)",
      "C[C@@H] 5",
      "[N+]=O)[O-] ))",
      ")))) )C5",
      "C nn",
      "=O) =O)N",
      "NC=O) C=",
      "C) =O)=O",
      ")))))))) C4",
      "C=O)N CCCNC=O)",
      "CC=O)N [C@@H]",
      "[C@H] CNC=O)",
      "CCC) C)C",
      "CO ccc",
      "[nH] n5",
      "CCN 6C=O)",
      "n ccn",
      "CC)C ))",
      "cccc Cl)",
      "cc Cl)",
      "# N",
      ")))) C4",
      "CCCCC 5",
      "CCO 6",
      "/ C=C/",
      "CCC S",
      "[C@@H] 5",
      "C) c5",
      "[C@H] O)",
      "C6 )))))))",
      "N 5C=O)",
      "o n5",
      "N =",
      "CC=O)N C[C@H]",
      "CCC 6",
      "F) c",
      ")) C4",
      "CC [C@]",
      "cc o",
      "CCCC NC=O)",
      "CO C",
      ")))))))) )))))))",
      "CC ccc",
      ")))))) CC6",
      "cc cnc",
      "CCC 5",
      ")))))))) ))))))))",
      "CC=O)N C)",
      "CCCO 5",
      "CC [C@@]",
      "CCN C)C=O)",
      "CC=O)N C[C@@H]",
      ")) )C4",
      "CC cn",
      "CCNC=O) ccc",
      "CO [C@H]",
      "CCCCC 4",
      "C[C@@H] 6",
      ")))))))) )C4",
      ")))) C5",
      ")) C5",
      "CCNC=O) cccc",
      "cc6 Cl",
      "c s5",
      "CCC =",
      "CC F)F)F",
      "CC[C@@H] C)",
      "- cccc",
      "[C@@H] O)",
      "CF)F ))",
      "O CC)C)C",
      "s 5))))))))",
      "C ncc",
      "C[C@] C)",
      "CC) =O",
      "S C)=O)=O",
      "CC6 )))))))",
      "C cccn",
      "cc F)",
      "cn [nH]",
      ")) )C",
      "C n",
      "CCCC) C)",
      ")))))) C6",
      "C ccnc",
      ")))))))) )C5",
      "C[C@@] C)",
      "n o5",
      "Ccc s",
      ")) )C5",
      "ccc Cl)",
      "C=O)N [C@H]C)",
      "O) CNC=O)",
      "CC F",
      "[C@H] NC=O)",
      "c6 F",
      ")))))))))) C4",
      "CO [C@@H]",
      "CC[C@H] 4",
      "CCO CC6",
      "CCN C)",
      "cn nn",
      "cc6 C",
      "))))) N",
      "cccc cc",
      "CCO C=O)",
      "CCCNC=O) [C@@H]",
      "CC nn",
      "NC=O) N",
      "CN 5C=O)",
      "CN =",
      "S C",
      "9 5",
      "c6 C",
      "CN C)C",
      "C=O)N [C@@H]C)",
      ")))))))))) C5",
      "CC6)))))))) )",
      "C F)",
      "ccn cc",
      "S =O)=O)N",
      "= N)",
      "C= N",
      "cn c5",
      "CCCNC=O) [C@H]",
      "C= CCCC",
      "C)C 6",
      "c O)",
      "ccnn C)c5",
      "CCCC [C@H]6",
      "CC l",
      "N #",
      "CCO C",
      ")))) )C6",
      "nn c5",
      "CC[C@@H] 6",
      "o 5))))))))",
      "C=O) O",
      ")) CC3",
      "C) C)",
      "CCCCC ))",
      "CN)=O ))",
      "ccs c",
      "CC[C@H] CNC=O)",
      "CCN C)C",
      "CC cnc",
      "N) =O)=O",
      "ccc C)",
      "n 9",
      "CCO )))",
      "[nH] c",
      "nccn c5",
      "n c5C",
      "CCCC [C@@H]6",
      "c F)c6",
      "C=O)N CCN",
      "[C@H] 5C",
      "Ccn cc",
      "[ S",
      "[C@@H] NC=O)",
      "CC6)))))))) ))",
      "cn cn",
      "CCNC=O) C=",
      ")))))))) )))))))))",
      ")C l",
      "4 C=O)",
      "C=O)N CCC[C@H]",
      "))))) CC6",
      "CCCC CC6",
      "CC[C@H] NC=O)",
      "C 8",
      "CCN 5C=O)",
      "CNC=O) C=",
      "cn c6",
      "CCC)C) O",
      "C F",
      "6)))))))) )))",
      "C5 =O",
      ")))))))) C6",
      "[C@H] 6C",
      "CCC)C )))",
      "CC O)",
      "N [C@H]",
      "@ ]"
    ]
  }
}