{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "\n": 4,
      "#": 5,
      "+": 6,
      "-": 7,
      "/": 8,
      "1": 9,
      "2": 10,
      "3": 11,
      "=": 12,
      "@": 13,
      "B": 14,
      "C": 15,
      "F": 16,
      "H": 17,
      "I": 18,
      "N": 19,
      "O": 20,
      "P": 21,
      "R": 22,
      "S": 23,
      "[": 24,
      "]": 25,
      "a": 26,
      "c": 27,
      "g": 28,
      "h": 29,
      "i": 30,
      "l": 31,
      "n": 32,
      "r": 33,
      "][": 34,
      "C][": 35,
      "1][": 36,
      "Br": 37,
      "an": 38,
      "ch": 39,
      "Bran": 40,
      "Branch": 41,
      "C][C][": 42,
      "Branch1][": 43,
      "Ri": 44,
      "ng": 45,
      "Ring": 46,
      "C][=": 47,
      "Ring1][": 48,
      "N][": 49,
      "O][": 50,
      "2][": 51,
      "Branch1][C][=": 52,
      "Branch1][C][=O][": 53,
      "C@": 54,
      "H1][": 55,
      "C][C][=": 56,
      "Branch2][": 57,
      "Branch1][C][C][": 58,
      "C][=Branch1][C][=O][": 59,
      "C][Ring1][": 60,
      "Ring2][": 61,
      "]\n": 62,
      "C][N][": 63,
      "C@H1][": 64,
      "C@@": 65,
      "Branch1][C][": 66,
      "C@@H1][": 67,
      "Branch2][Ring1][": 68,
      "Ring2][Ring1][": 69,
      "S][": 70,
      "F][": 71,
      "N][C][C][": 72,
      "Ring1][=": 73,
      "N][C][=Branch1][C][=O][": 74,
      "C][C][=Branch1][C][=O][": 75,
      "C][O][": 76,
      "C][C@H1][": 77,
      "[C][C][": 78,
      "Branch1][=": 79,
      "C][=C][C][=": 80,
      "C][Ring1][=": 81,
      "Branch1][C][F][": 82,
      "C][C@@H1][": 83,
      "1]\n": 84,
      "C][Ring1][#": 85,
      "2]\n": 86,
      "C][Ring2][Ring1][": 87,
      "C][N][C][=Branch1][C][=O][": 88,
      "Branch1][C][=Branch1][C][=O][": 89,
      "C][C][C][C][": 90,
      "N][=": 91,
      "C][Branch1][": 92,
      "Branch1]\n": 93,
      "Branch2]\n": 94,
      "C][=Branch1][C][=O][N][": 95,
      "C][N][=": 96,
      "C]\n": 97,
      "C][=N][": 98,
      "Ring1][#": 99,
      "P][": 100,
      "Branch1][C][O][": 101,
      "C][Branch1][C][C][": 102,
      "C][Branch2][Ring1][": 103,
      "C][C][=C][C][=": 104,
      "Branch2][Ring2][": 105,
      "C][C][=Branch1][C][=O][N][": 106,
      "C][C][N][": 107,
      "C][S][": 108,
      "C][=C][C][": 109,
      "Cl": 110,
      "NH1][": 111,
      "Branch1][C][C][C][C][": 112,
      "C][=Branch1][C][=O][N][C][C][": 113,
      "Ring1][Branch1][": 114,
      "[C][O][": 115,
      "Cl][": 116,
      "C][Branch1][C][F][": 117,
      "Branch1][#": 118,
      "C][C][=N][": 119,
      "Branch1][Ring1][": 120,
      "C][Ring1][=Branch1][": 121,
      "Ring1][=Branch1][": 122,
      "O]\n": 123,
      "O][C][C][": 124,
      "Branch2][Ring1][=": 125,
      "O][=": 126,
      "=Branch1][C][=O][": 127,
      "C][C][=Branch1][C][=O][N][C][C][": 128,
      "Branch1][C][Cl][": 129,
      "Ring1][Ring1][": 130,
      "C@][": 131,
      "C][Branch1][=": 132,
      "C@@][": 133,
      "C][Ring1][#Branch1][": 134,
      "Branch1][C][=Branch1][C][=O][N][": 135,
      "[O][=": 136,
      "C@H1][C][C][": 137,
      "C][Branch2][Ring2][": 138,
      "C][N][Branch2][Ring1][": 139,
      "C@H1][Branch1][C][C][": 140,
      "Branch1][P][": 141,
      "C@@H1][C][C][": 142,
      "Branch1][S][": 143,
      "C][=C][C][=C][C][=": 144,
      "C][Ring1][Branch2][": 145,
      "[C][C][Branch1][C][C][": 146,
      "Branch1][C][F][F][": 147,
      "C][NH1][": 148,
      "C@@H1][Branch1][C][C][": 149,
      "C][=C][N][=": 150,
      "Branch1][Ring2][": 151,
      "N]\n": 152,
      "C][#": 153,
      "C][Branch1][C][Cl][": 154,
      "N][Branch1][C][C][": 155,
      "C][N][Branch1][C][C][": 156,
      "Ring2][Ring1][#": 157,
      "C][C][=C][C][": 158,
      "Branch1][C][=Branch1][C][=O][N][C][C][": 159,
      "Branch1][C][C][C][Ring1][": 160,
      "Branch2][Ring1][#": 161,
      "=N][": 162,
      "Ring1]\n": 163,
      "Ring1][Branch2][": 164,
      "C][Branch1][C][C][Branch1][C][C][": 165,
      "Ring1][Ring2][": 166,
      "Ring2][Ring1][=": 167,
      "C][C][N][C][=Branch1][C][=O][": 168,
      "Branch2][Ring1][Ring1][": 169,
      "C][Ring1][Branch1][": 170,
      "N][=N][": 171,
      "Br][": 172,
      "[C][C@H1][": 173,
      "[C][C@@H1][": 174,
      "C][Branch1][Ring1][": 175,
      "Branch2][Ring1][Ring2][": 176,
      "C][Ring2][Ring1][#": 177,
      "[C][N][": 178,
      "Branch1][N][C][=Branch1][C][=O][": 179,
      "Ring1][Branch1][C][C][": 180,
      "Ring1][=Branch2][": 181,
      "C][C][O][": 182,
      "C][=C][C][=C][C][": 183,
      "C][Ring1][=Branch2][": 184,
      "Branch1][C][C][Branch1][C][C][": 185,
      "C][Branch1][C][O][": 186,
      "C][Ring2][Ring1][=": 187,
      "Ring1][S][": 188,
      "Ring2]\n": 189,
      "C][C@][": 190,
      "C][C][C@H1][": 191,
      "P]\n": 192,
      "F]\n": 193,
      "Branch1][C][Br][": 194,
      "C][C][Ring2][Ring1][": 195,
      "C][C@@][": 196,
      "N][C][=": 197,
      "Branch1][=Branch2][": 198,
      "=Branch1][C][=O][=Branch1][C][=O][": 199,
      "Branch1][Ring1][C][O][": 200,
      "C][Branch1][#": 201,
      "S]\n": 202,
      "C][=N][C][=": 203,
      "C][Branch2][Ring1][=": 204,
      "Ring1][=Branch1][C][C][": 205,
      "Ring1][#Branch1][": 206,
      "Branch1][=N][": 207,
      "Branch1][P][C][=Branch1][C][=O][": 208,
      "C][C][C][Ring1][": 209,
      "[C][C][=C][C][=": 210,
      "Ring2][Ring1][#Branch2]\n": 211,
      "Ring1][P][": 212,
      "Branch2][Ring2][Ring1][": 213,
      "Ring2][Ring1][=Branch2]\n": 214,
      "C][N][Branch1][=": 215,
      "[C][#": 216,
      "Branch1][C][F][=": 217,
      "Branch1][S][C][=Branch1][C][=O][": 218,
      "[C][C][=": 219,
      "Ring1][Branch1][C][": 220,
      "[C][=C][C][": 221,
      "C][Branch2][Ring1][#": 222,
      "[C][C][=N][": 223,
      "Ring1][Branch1]\n": 224,
      "Branch1][#C][C][=Branch1][C][=O][": 225,
      "C][=Branch1][C][=O][N][C][C@H1][": 226,
      "Ring1][=Branch1]\n": 227,
      "C][C][C@@H1][": 228,
      "C][Ring1][#Branch2][": 229,
      "C][Ring1][S][": 230,
      "C][Branch1][=Branch2][": 231,
      "[C][C][O][": 232,
      "C][=C][C][=N][": 233,
      "C][=Branch1][C][=O][N][C][C@@H1][": 234,
      "C][=C][C][=C][C][=C][Ring1][=Branch1][": 235,
      "[C][=": 236,
      "Ring1][#Branch2][": 237,
      "C][Ring1][P][": 238,
      "Branch1][C][C][=": 239,
      "Branch1][C][N][=": 240,
      "[C][C][=C][C][": 241,
      "N][C][=Branch1][C][=O][C][C][": 242,
      "Branch1][C][Cl][=": 243,
      "C][C@H1][Ring1][Ring1][": 244,
      "C][Branch1][C][F][Branch1][C][F][F][": 245,
      "C][Branch1][C][C][=": 246,
      "Branch1][C][Ring2][Ring1][": 247,
      "[C][C][N][": 248,
      "Branch1][C][N][C][=Branch1][C][=O][": 249,
      "C][Ring1][=Branch1]\n": 250,
      "S][=Branch1][C][=O][=Branch1][C][=O][": 251,
      "C][N][Branch1][C][C][C][=Branch1][C][=O][": 252,
      "C][C][C][N][": 253,
      "Branch1][N][": 254,
      "C][C@H1][Branch1][C][C][": 255,
      "C][=C][S][": 256,
      "+1][": 257,
      "N+1][": 258,
      "C][C@@H1][Branch1][C][C][": 259,
      "C][Branch1][C][Br][": 260,
      "C][/": 261,
      "C][Ring1][=Branch1][C][C][": 262,
      "Branch1][#Branch2][": 263,
      "Branch1][C][C][C][Ring1][Ring1][": 264,
      "C][O][C][C][": 265,
      "Ring1][=Branch1][C][=Branch1][C][=O][": 266,
      "C][=Branch1][C][=O][N][C@H1][": 267,
      "C][C][=C][C][=C][C][=": 268,
      "C][Ring1][P]\n": 269,
      "[C][S][": 270,
      "C][=C][Ring1][#Branch1][": 271,
      "O][C][=": 272,
      "C][C][C][C][C][C][": 273,
      "Ring2][Ring1][O]\n": 274,
      "C][N][C][=Branch1][C][=O][C][C][": 275,
      "C][Ring1][Ring2][": 276,
      "Ring1][Branch1][C][=Branch1][C][=O][": 277,
      "NH1][C][=": 278,
      "C][C@H1][Ring1][Branch1][": 279,
      "Ring1][=N][": 280,
      "C][=C][Ring1][#": 281,
      "C][Ring1][S]\n": 282,
      "C][Branch1][C][F][Branch1][C][F][": 283,
      "C][C][=Branch1][C][=O][N][C][C@H1][": 284,
      "-1][": 285,
      "C][C@@H1][Ring1][Ring1][": 286,
      "N][C][=Branch1][C][=O][C@@H1][": 287,
      "C][=Branch1][C][=O][N][C@@H1][": 288,
      "Branch1][Ring1][C][C][": 289,
      "N][Branch1][C][C][C][=Branch1][C][=O][": 290,
      "Branch2][Ring1][Branch2][": 291,
      "Ring2][Ring1][Branch2]\n": 292,
      "N][C][=Branch1][C][=O][N][": 293,
      "Ring2][Ring1][N]\n": 294,
      "C][Ring2][Ring1][#Branch2]\n": 295,
      "C][C][=Branch1][C][=O][N][C][C@@H1][": 296,
      "N][C][=Branch1][C][=O][C@H1][": 297,
      "C][Ring2][Ring1][=Branch2]\n": 298,
      "Branch1][O][": 299,
      "Branch2][Ring1][=Branch2][": 300,
      "C][Ring2][Ring1][O]\n": 301,
      "[O][=C][Branch2][Ring1][": 302,
      "Branch1][Branch2][": 303,
      "[C][O][C][=Branch1][C][=O][": 304,
      "C][C][Ring1][": 305,
      "C][Ring2][Ring1][C]\n": 306,
      "C][C][C][C][N][": 307,
      "Branch1][Branch1][C][C][": 308,
      "Ring1][=Branch1][C][": 309,
      "Branch2][Ring2][=": 310,
      "[C][C][C@H1][": 311,
      "Branch1][C][=N][": 312,
      "Ring2][Ring1][#Branch1]\n": 313,
      "C][Branch1][Ring2][": 314,
      "N+1][=Branch1][C][=O][": 315,
      "N+1][=Branch1][C][=O][O": 316,
      "C][Ring1][#C]\n": 317,
      "Branch1][C][F][Branch1][C][F][": 318,
      "[C][C][C@@H1][": 319,
      "Branch1][=Branch1][C][": 320,
      "C][C][=Branch1][C][=O][N][C@H1][": 321,
      "C@][Branch1][C][C][": 322,
      "C][NH1][N][=": 323,
      "N][C][=Branch1][C][=O][C][=C][C][=": 324,
      "Branch2][Ring1][S][": 325,
      "Branch2][Ring1][P][": 326,
      "C][Ring2][Ring1][Ring1]\n": 327,
      "C][N][C][C][": 328,
      "Ring1][Branch1][C][=Branch1][C][=O][N][": 329,
      "C][Branch1][Branch2][": 330,
      "C@H1][Branch1][C][O][": 331,
      "C][=C][C][=C][C][=C][Ring1][=": 332,
      "C][N][Branch1][P][C][=Branch1][C][=O][": 333,
      "Cl]\n": 334,
      "C][N][C][=Branch1][C][=O][C@@H1][": 335,
      "C][=C][/": 336,
      "C][C][=Branch1][C][=O][N][C@@H1][": 337,
      "C][N][Branch2][Ring1][C][C][=Branch1][C][=O][": 338,
      "[C][C][C][C][": 339,
      "C][=Branch1][C][=O][N][Branch1][C][C][": 340,
      "C][Ring1][#Branch1]\n": 341,
      "C@@][Branch1][C][C][": 342,
      "C][=C][O][": 343,
      "Branch2][Ring2][Ring2][": 344,
      "C][=C][C][=C][Branch1][C][F][": 345,
      "C][C@H1][Branch1][C][O][": 346,
      "C][C][=C][S][": 347,
      "N+1][=Branch1][C][=O][O-1][": 348,
      "C][Branch2][Ring2][Ring1][": 349,
      "C][N][Branch2][Ring1][Ring1][": 350,
      "C][Branch2][Ring2][=": 351,
      "Ring1][#Branch1]\n": 352,
      "C][N][Branch1][=C][C][=Branch1][C][=O][": 353,
      "C][Branch1][=Branch1][C][": 354,
      "C][Branch2][Ring1][P][": 355,
      "C][Ring2][Ring1][Branch2]\n": 356,
      "Branch1][=C][C][=Branch1][C][=O][": 357,
      "C][C][N][Branch2][Ring1][": 358,
      "C][N][Branch1][S][C][=Branch1][C][=O][": 359,
      "C][Branch2][Ring1][S][": 360,
      "C][NH1][C][=": 361,
      "C][N][C][=Branch1][C][=O][C@H1][": 362,
      "C][Ring2][Ring1][Ring2]\n": 363,
      "Branch1][C][C][C]\n": 364,
      "C][=C][C][=C][N][=": 365,
      "C][C@@H1][Branch1][C][O][": 366,
      "C][N][Branch1][#C][C][=Branch1][C][=O][": 367,
      "N][Branch1][C][C][C][=": 368,
      "C][=C][N][": 369,
      "Branch2][Ring2][#": 370,
      "C][=C][C][=C][Branch1][C][Cl][": 371,
      "[C][O][C][C][": 372,
      "C][Branch1][C][C][Branch1][C][C][C][C][": 373,
      "N][C][=Branch1][C][=O][N][C][C][": 374,
      "C][C][N][Branch1][C][C][": 375,
      "[O][=C][Branch1][": 376,
      "Branch1][C][C][=Branch1][C][=O][": 377,
      "C][C][=Branch1][C][=O][N][Branch1][C][C][": 378,
      "Ring2][Ring1][=Branch1]\n": 379,
      "C][Branch1][C][Cl][=": 380,
      "C][Branch2][Ring2][Ring2][": 381,
      "C][N][Branch2][Ring1][Ring1][C][=Branch1][C][=O][": 382,
      "Branch2][Ring1][C][N][C][=Branch1][C][=O][": 383,
      "C][C@@H1][Ring1][Branch1][": 384,
      "C][Ring1][Branch1]\n": 385,
      "Ring1][#Branch1][C][C][": 386,
      "C][F][": 387,
      "C][C@@H1][C][C][": 388,
      "C][C][=C][N][=": 389,
      "C][C][C][C][Ring1][": 390,
      "Branch2][Ring1][#Branch2][": 391,
      "C][Branch1][C][F][=": 392,
      "C][Branch1][C][C][C][C][": 393,
      "C][Branch1][#Branch2][": 394,
      "C][Ring1][O][": 395,
      "Branch1][C][Br][=": 396,
      "C][Ring1][=Branch1][=": 397,
      "C][C][=C][C][=C][C][": 398,
      "Ring1][=Branch2]\n": 399,
      "=O][": 400,
      "N][C][=Branch1][C][=O][C][=C][C][": 401,
      "C][=C][Branch1][C][C][": 402,
      "C][Ring1][Branch2]\n": 403,
      "Branch1][Ring1][O][": 404,
      "Ring1][O][": 405,
      "C][C@H1][C][C][": 406,
      "Branch2][C]\n": 407,
      "C][=Branch1][C][=O][N][C][C][N][": 408,
      "C@@H1][Branch1][C][O][": 409,
      "C][Ring2][Ring1][N]\n": 410,
      "Branch2][Ring1][Ring1][C][=Branch1][C][=O][": 411,
      "[C][#C][C][": 412,
      "C][Ring1][=C]\n": 413,
      "C][N][Branch2][Ring1][Ring2][": 414,
      "C][N][C][=": 415,
      "Branch1][C][C][C][Ring1][Ring2][": 416,
      "Branch1][Ring1][C][#": 417,
      "N][=C][C][=": 418,
      "Ring1][Branch2]\n": 419,
      "Branch1][N+1][=Branch1][C][=O][O-1][": 420,
      "N][C][C][N][": 421,
      "C][Ring1][=Branch2]\n": 422,
      "C][Ring1][#Branch1][C][C][": 423,
      "C][Branch1][C][C][C]\n": 424,
      "C@H1][C][C][C@H1][": 425,
      "[N][": 426,
      "C][Ring1][Branch1][C][C][": 427,
      "C][Ring1][=Branch1][C][": 428,
      "Ring1][Branch1][C][=": 429,
      "C][Branch2][Ring2][#": 430,
      "C][N][=N][": 431,
      "O][C]\n": 432,
      "C][=C][C][Branch1][C][F][=": 433,
      "Ring1][Branch1][C][=Branch1][C][=O][N][C][C][": 434,
      "S][C][=": 435,
      "Ring1][N][": 436,
      "C][C][=C][Ring1][#Branch1][": 437,
      "C][Branch1][C][N][=": 438,
      "C][O][C][=": 439,
      "Ring1][#C]\n": 440,
      "C][=N][N][=": 441,
      "C][Ring2][Ring1][#Branch1]\n": 442,
      "/C][=C][/": 443,
      "=O]\n": 444,
      "C][=Branch1][C][=O][C][C][": 445,
      "C][C][=C][C][=C][C][=C][Ring1][=Branch1][": 446,
      "Ring1][#Branch1][C][=Branch1][C][=O][": 447,
      "Branch1][C][F][Branch1][C][F][F][": 448,
      "[C][O][C][=C][C][=": 449,
      "C@H1][C][C][N][": 450,
      "C][Branch1][Ring1][C][#": 451,
      "Ring2][Ring1][C]\n": 452,
      "Branch1][#C][N][C][=Branch1][C][=O][": 453,
      "N][C][C][C][C][": 454,
      "C][C][=N][N][": 455,
      "Branch2][Ring1][O][": 456,
      "Branch2][Ring1][=Branch1][C][=Branch1][C][=O][": 457,
      "C][Ring2][Ring1][Branch1]\n": 458,
      "Ring1][P]\n": 459,
      "C@@H1][C][C][N][": 460,
      "C][C][C][Ring1][Ring1][": 461,
      "[C][C][C][=": 462,
      "Branch2][Ring1][C][C][N][C][=Branch1][C][=O][": 463,
      "C][N][Ring1][Branch1][C][=Branch1][C][=O][": 464,
      "O][C@H1][": 465,
      "Branch1][P][N][C][=Branch1][C][=O][": 466,
      "Ring1][=Branch1][C][=Branch1][C][=O][N][": 467,
      "C][C][O][C][C][": 468,
      "C][=N][N][": 469,
      "Branch2][Ring1][Branch1][N][C][=Branch1][C][=O][": 470,
      "C][Ring1][Branch1][=": 471,
      "Ring1][S]\n": 472,
      "C][N][Branch2][Ring1][#": 473,
      "Branch2][Ring1][Ring1][N][C][=Branch1][C][=O][": 474,
      "[C][C][Branch1][C][C][Branch1][C][C][": 475,
      "C][=Branch1][C][=O][N][C][C][C@H1][": 476,
      "C][N][Branch2][Ring1][Ring2][C][=Branch1][C][=O][": 477,
      "C][C][=C][N][": 478,
      "C][=C][N][=C][C][": 479,
      "N][N][": 480,
      "C][=C][C][Branch1][C][Cl][=": 481,
      "Ring1][=Branch1][=": 482,
      "Branch1][=Branch1][C][C][C][Ring1][Ring1][": 483,
      "C][Branch1][Branch1][C][C][": 484,
      "C@H1][C][C][C@@H1][": 485,
      "C][C][=Branch1][C][=O][N][C][C][N][": 486,
      "C][Branch1][C][F][F][": 487,
      "C][C@][Branch1][C][C][": 488,
      "Branch1][Ring2][=": 489,
      "C][C]\n": 490,
      "C][C][C][Ring1][Ring1]\n": 491,
      "Ring2][Ring1][Ring1]\n": 492,
      "Ring1][#Branch2]\n": 493,
      "C][Ring1][Branch1][C][=Branch1][C][=O][N][": 494,
      "C][C][Branch1][C][C][Branch1][C][C][": 495,
      "Branch1][S][N][C][=Branch1][C][=O][": 496,
      "C][Branch1][Ring1][C][O][": 497,
      "S][Branch1][C][C][=Branch1][C][=O][": 498,
      "N][=N][N][": 499
    },
    "merges": [
      "] [",
      "C ][",
      "1 ][",
      "B r",
      "a n",
      "c h",
      "Br an",
      "Bran ch",
      "C][ C][",
      "Branch 1][",
      "R i",
      "n g",
      "Ri ng",
      "C][ =",
      "Ring 1][",
      "N ][",
      "O ][",
      "2 ][",
      "Branch1][ C][=",
      "Branch1][C][= O][",
      "C @",
      "H 1][",
      "C][C][ =",
      "Branch 2][",
      "Branch1][ C][C][",
      "C][= Branch1][C][=O][",
      "C][ Ring1][",
      "Ring 2][",
      "] \n",
      "C][ N][",
      "C@ H1][",
      "C@ @",
      "Branch1][ C][",
      "C@@ H1][",
      "Branch2][ Ring1][",
      "Ring2][ Ring1][",
      "S ][",
      "F ][",
      "N][ C][C][",
      "Ring1][ =",
      "N][ C][=Branch1][C][=O][",
      "C][C][= Branch1][C][=O][",
      "C][ O][",
      "C][ C@H1][",
      "[ C][C][",
      "Branch1][ =",
      "C][= C][C][=",
      "C][Ring1][ =",
      "Branch1][C][ F][",
      "C][ C@@H1][",
      "1 ]\n",
      "C][Ring1][ #",
      "2 ]\n",
      "C][ Ring2][Ring1][",
      "C][N][ C][=Branch1][C][=O][",
      "Branch1][C][= Branch1][C][=O][",
      "C][C][ C][C][",
      "N][ =",
      "C][ Branch1][",
      "Branch 1]\n",
      "Branch 2]\n",
      "C][=Branch1][C][=O][ N][",
      "C][N][ =",
      "C ]\n",
      "C][= N][",
      "Ring1][ #",
      "P ][",
      "Branch1][C][ O][",
      "C][ Branch1][C][C][",
      "C][ Branch2][Ring1][",
      "C][C][= C][C][=",
      "Branch2][ Ring2][",
      "C][C][=Branch1][C][=O][ N][",
      "C][C][ N][",
      "C][ S][",
      "C][= C][C][",
      "C l",
      "N H1][",
      "Branch1][C][C][ C][C][",
      "C][=Branch1][C][=O][ N][C][C][",
      "Ring1][ Branch1][",
      "[ C][O][",
      "Cl ][",
      "C][ Branch1][C][F][",
      "Branch1][ #",
      "C][C][= N][",
      "Branch1][ Ring1][",
      "C][Ring1][= Branch1][",
      "Ring1][= Branch1][",
      "O ]\n",
      "O][ C][C][",
      "Branch2][Ring1][ =",
      "O][ =",
      "= Branch1][C][=O][",
      "C][C][=Branch1][C][=O][ N][C][C][",
      "Branch1][C][ Cl][",
      "Ring1][ Ring1][",
      "C@ ][",
      "C][ Branch1][=",
      "C@@ ][",
      "C][Ring1][# Branch1][",
      "Branch1][C][=Branch1][C][=O][ N][",
      "[ O][=",
      "C@H1][ C][C][",
      "C][ Branch2][Ring2][",
      "C][N][ Branch2][Ring1][",
      "C@H1][ Branch1][C][C][",
      "Branch1][ P][",
      "C@@H1][ C][C][",
      "Branch1][ S][",
      "C][=C][C][= C][C][=",
      "C][Ring1][ Branch2][",
      "[C][C][ Branch1][C][C][",
      "Branch1][C][F][ F][",
      "C][ NH1][",
      "C@@H1][ Branch1][C][C][",
      "C][= C][N][=",
      "Branch1][ Ring2][",
      "N ]\n",
      "C][ #",
      "C][ Branch1][C][Cl][",
      "N][ Branch1][C][C][",
      "C][N][ Branch1][C][C][",
      "Ring2][Ring1][ #",
      "C][C][= C][C][",
      "Branch1][C][=Branch1][C][=O][ N][C][C][",
      "Branch1][C][C][ C][Ring1][",
      "Branch2][Ring1][ #",
      "= N][",
      "Ring 1]\n",
      "Ring1][ Branch2][",
      "C][Branch1][C][C][ Branch1][C][C][",
      "Ring1][ Ring2][",
      "Ring2][Ring1][ =",
      "C][C][ N][C][=Branch1][C][=O][",
      "Branch2][Ring1][ Ring1][",
      "C][Ring1][ Branch1][",
      "N][= N][",
      "Br ][",
      "[ C][C@H1][",
      "[ C][C@@H1][",
      "C][Branch1][ Ring1][",
      "Branch2][Ring1][ Ring2][",
      "C][Ring2][Ring1][ #",
      "[ C][N][",
      "Branch1][ N][C][=Branch1][C][=O][",
      "Ring1][ Branch1][C][C][",
      "Ring1][= Branch2][",
      "C][C][ O][",
      "C][=C][C][= C][C][",
      "C][Ring1][= Branch2][",
      "Branch1][C][C][ Branch1][C][C][",
      "C][ Branch1][C][O][",
      "C][Ring2][Ring1][ =",
      "Ring1][ S][",
      "Ring 2]\n",
      "C][ C@][",
      "C][C][ C@H1][",
      "P ]\n",
      "F ]\n",
      "Branch1][C][ Br][",
      "C][C][ Ring2][Ring1][",
      "C][ C@@][",
      "N][ C][=",
      "Branch1][= Branch2][",
      "=Branch1][C][=O][ =Branch1][C][=O][",
      "Branch1][Ring1][ C][O][",
      "C][Branch1][ #",
      "S ]\n",
      "C][=N][ C][=",
      "C][Branch2][Ring1][ =",
      "Ring1][= Branch1][C][C][",
      "Ring1][# Branch1][",
      "Branch1][= N][",
      "Branch1][P][ C][=Branch1][C][=O][",
      "C][C][ C][Ring1][",
      "[ C][C][=C][C][=",
      "Ring2][Ring1][# Branch2]\n",
      "Ring1][ P][",
      "Branch2][ Ring2][Ring1][",
      "Ring2][Ring1][= Branch2]\n",
      "C][N][ Branch1][=",
      "[ C][#",
      "Branch1][C][F][ =",
      "Branch1][S][ C][=Branch1][C][=O][",
      "[ C][C][=",
      "Ring1][ Branch1][C][",
      "[ C][=C][C][",
      "C][Branch2][Ring1][ #",
      "[ C][C][=N][",
      "Ring1][ Branch1]\n",
      "Branch1][# C][C][=Branch1][C][=O][",
      "C][=Branch1][C][=O][N][ C][C@H1][",
      "Ring1][= Branch1]\n",
      "C][C][ C@@H1][",
      "C][Ring1][# Branch2][",
      "C][Ring1][ S][",
      "C][Branch1][= Branch2][",
      "[C][C][ O][",
      "C][=C][C][= N][",
      "C][=Branch1][C][=O][N][ C][C@@H1][",
      "C][=C][C][=C][C][= C][Ring1][=Branch1][",
      "[ C][=",
      "Ring1][# Branch2][",
      "C][Ring1][ P][",
      "Branch1][ C][C][=",
      "Branch1][ C][N][=",
      "[ C][C][=C][C][",
      "N][C][=Branch1][C][=O][ C][C][",
      "Branch1][C][Cl][ =",
      "C][C@H1][ Ring1][Ring1][",
      "C][Branch1][C][F][ Branch1][C][F][F][",
      "C][Branch1][ C][C][=",
      "Branch1][C][ Ring2][Ring1][",
      "[C][C][ N][",
      "Branch1][ C][N][C][=Branch1][C][=O][",
      "C][Ring1][= Branch1]\n",
      "S][ =Branch1][C][=O][=Branch1][C][=O][",
      "C][N][Branch1][C][C][ C][=Branch1][C][=O][",
      "C][C][ C][N][",
      "Branch1][ N][",
      "C][C@H1][ Branch1][C][C][",
      "C][= C][S][",
      "+ 1][",
      "N +1][",
      "C][C@@H1][ Branch1][C][C][",
      "C][ Branch1][C][Br][",
      "C][ /",
      "C][Ring1][= Branch1][C][C][",
      "Branch1][# Branch2][",
      "Branch1][C][C][C][Ring1][ Ring1][",
      "C][O][ C][C][",
      "Ring1][= Branch1][C][=Branch1][C][=O][",
      "C][=Branch1][C][=O][N][ C@H1][",
      "C][C][=C][C][= C][C][=",
      "C][Ring1][ P]\n",
      "[ C][S][",
      "C][= C][Ring1][#Branch1][",
      "O][ C][=",
      "C][C][C][C][ C][C][",
      "Ring2][Ring1][ O]\n",
      "C][N][C][=Branch1][C][=O][ C][C][",
      "C][Ring1][ Ring2][",
      "Ring1][ Branch1][C][=Branch1][C][=O][",
      "NH1][ C][=",
      "C][C@H1][ Ring1][Branch1][",
      "Ring1][= N][",
      "C][= C][Ring1][#",
      "C][Ring1][ S]\n",
      "C][Branch1][C][F][ Branch1][C][F][",
      "C][C][=Branch1][C][=O][N][ C][C@H1][",
      "- 1][",
      "C][C@@H1][ Ring1][Ring1][",
      "N][C][=Branch1][C][=O][ C@@H1][",
      "C][=Branch1][C][=O][N][ C@@H1][",
      "Branch1][Ring1][ C][C][",
      "N][Branch1][C][C][ C][=Branch1][C][=O][",
      "Branch2][Ring1][ Branch2][",
      "Ring2][Ring1][ Branch2]\n",
      "N][C][=Branch1][C][=O][ N][",
      "Ring2][Ring1][ N]\n",
      "C][Ring2][Ring1][# Branch2]\n",
      "C][C][=Branch1][C][=O][N][ C][C@@H1][",
      "N][C][=Branch1][C][=O][ C@H1][",
      "C][Ring2][Ring1][= Branch2]\n",
      "Branch1][ O][",
      "Branch2][Ring1][= Branch2][",
      "C][Ring2][Ring1][ O]\n",
      "[O][= C][Branch2][Ring1][",
      "Branch1][ Branch2][",
      "[C][O][ C][=Branch1][C][=O][",
      "C][C][ Ring1][",
      "C][Ring2][Ring1][ C]\n",
      "C][C][C][C][ N][",
      "Branch1][ Branch1][C][C][",
      "Ring1][= Branch1][C][",
      "Branch2][Ring2][ =",
      "[C][C][ C@H1][",
      "Branch1][C][= N][",
      "Ring2][Ring1][# Branch1]\n",
      "C][Branch1][ Ring2][",
      "N+1][ =Branch1][C][=O][",
      "N+1][=Branch1][C][=O][ O",
      "C][Ring1][# C]\n",
      "Branch1][C][F][ Branch1][C][F][",
      "[C][C][ C@@H1][",
      "Branch1][= Branch1][C][",
      "C][C][=Branch1][C][=O][N][ C@H1][",
      "C@][ Branch1][C][C][",
      "C][NH1][ N][=",
      "N][C][=Branch1][C][=O][ C][=C][C][=",
      "Branch2][Ring1][ S][",
      "Branch2][Ring1][ P][",
      "C][Ring2][Ring1][ Ring1]\n",
      "C][N][ C][C][",
      "Ring1][ Branch1][C][=Branch1][C][=O][N][",
      "C][Branch1][ Branch2][",
      "C@H1][ Branch1][C][O][",
      "C][=C][C][=C][C][= C][Ring1][=",
      "C][N][ Branch1][P][C][=Branch1][C][=O][",
      "Cl ]\n",
      "C][N][C][=Branch1][C][=O][ C@@H1][",
      "C][= C][/",
      "C][C][=Branch1][C][=O][N][ C@@H1][",
      "C][N][Branch2][Ring1][ C][C][=Branch1][C][=O][",
      "[C][C][ C][C][",
      "C][=Branch1][C][=O][N][ Branch1][C][C][",
      "C][Ring1][# Branch1]\n",
      "C@@][ Branch1][C][C][",
      "C][= C][O][",
      "Branch2][Ring2][ Ring2][",
      "C][=C][C][= C][Branch1][C][F][",
      "C][C@H1][ Branch1][C][O][",
      "C][C][= C][S][",
      "N+1][=Branch1][C][=O][O -1][",
      "C][ Branch2][Ring2][Ring1][",
      "C][N][Branch2][Ring1][ Ring1][",
      "C][Branch2][Ring2][ =",
      "Ring1][# Branch1]\n",
      "C][N][Branch1][= C][C][=Branch1][C][=O][",
      "C][Branch1][= Branch1][C][",
      "C][Branch2][Ring1][ P][",
      "C][Ring2][Ring1][ Branch2]\n",
      "Branch1][= C][C][=Branch1][C][=O][",
      "C][C][N][ Branch2][Ring1][",
      "C][N][ Branch1][S][C][=Branch1][C][=O][",
      "C][Branch2][Ring1][ S][",
      "C][NH1][ C][=",
      "C][N][C][=Branch1][C][=O][ C@H1][",
      "C][Ring2][Ring1][ Ring2]\n",
      "Branch1][C][C][ C]\n",
      "C][=C][C][= C][N][=",
      "C][C@@H1][ Branch1][C][O][",
      "C][N][ Branch1][#C][C][=Branch1][C][=O][",
      "N][Branch1][C][C][ C][=",
      "C][= C][N][",
      "Branch2][Ring2][ #",
      "C][=C][C][= C][Branch1][C][Cl][",
      "[C][O][ C][C][",
      "C][Branch1][C][C][ Branch1][C][C][C][C][",
      "N][C][=Branch1][C][=O][ N][C][C][",
      "C][C][N][ Branch1][C][C][",
      "[O][= C][Branch1][",
      "Branch1][ C][C][=Branch1][C][=O][",
      "C][C][=Branch1][C][=O][N][ Branch1][C][C][",
      "Ring2][Ring1][= Branch1]\n",
      "C][Branch1][C][Cl][ =",
      "C][Branch2][Ring2][ Ring2][",
      "C][N][Branch2][Ring1][Ring1][ C][=Branch1][C][=O][",
      "Branch2][Ring1][ C][N][C][=Branch1][C][=O][",
      "C][C@@H1][ Ring1][Branch1][",
      "C][Ring1][ Branch1]\n",
      "Ring1][# Branch1][C][C][",
      "C][ F][",
      "C][C@@H1][ C][C][",
      "C][C][= C][N][=",
      "C][C][C][C][ Ring1][",
      "Branch2][Ring1][# Branch2][",
      "C][Branch1][C][F][ =",
      "C][Branch1][C][C][ C][C][",
      "C][Branch1][# Branch2][",
      "C][Ring1][ O][",
      "Branch1][C][Br][ =",
      "C][Ring1][= Branch1][=",
      "C][C][=C][C][= C][C][",
      "Ring1][= Branch2]\n",
      "= O][",
      "N][C][=Branch1][C][=O][ C][=C][C][",
      "C][= C][Branch1][C][C][",
      "C][Ring1][ Branch2]\n",
      "Branch1][Ring1][ O][",
      "Ring1][ O][",
      "C][C@H1][ C][C][",
      "Branch2][ C]\n",
      "C][=Branch1][C][=O][N][C][C][ N][",
      "C@@H1][ Branch1][C][O][",
      "C][Ring2][Ring1][ N]\n",
      "Branch2][Ring1][Ring1][ C][=Branch1][C][=O][",
      "[C][# C][C][",
      "C][Ring1][= C]\n",
      "C][N][Branch2][Ring1][ Ring2][",
      "C][N][ C][=",
      "Branch1][C][C][C][Ring1][ Ring2][",
      "Branch1][Ring1][ C][#",
      "N][= C][C][=",
      "Ring1][ Branch2]\n",
      "Branch1][ N+1][=Branch1][C][=O][O-1][",
      "N][C][C][ N][",
      "C][Ring1][= Branch2]\n",
      "C][Ring1][# Branch1][C][C][",
      "C][Branch1][C][C][ C]\n",
      "C@H1][C][C][ C@H1][",
      "[ N][",
      "C][Ring1][ Branch1][C][C][",
      "C][Ring1][= Branch1][C][",
      "Ring1][ Branch1][C][=",
      "C][Branch2][Ring2][ #",
      "C][N][= N][",
      "O][ C]\n",
      "C][=C][C][ Branch1][C][F][=",
      "Ring1][ Branch1][C][=Branch1][C][=O][N][C][C][",
      "S][ C][=",
      "Ring1][ N][",
      "C][C][= C][Ring1][#Branch1][",
      "C][Branch1][ C][N][=",
      "C][O][ C][=",
      "Ring1][# C]\n",
      "C][=N][ N][=",
      "C][Ring2][Ring1][# Branch1]\n",
      "/ C][=C][/",
      "= O]\n",
      "C][=Branch1][C][=O][ C][C][",
      "C][C][=C][C][=C][C][= C][Ring1][=Branch1][",
      "Ring1][# Branch1][C][=Branch1][C][=O][",
      "Branch1][C][F][ Branch1][C][F][F][",
      "[C][O][ C][=C][C][=",
      "C@H1][ C][C][N][",
      "C][Branch1][Ring1][ C][#",
      "Ring2][Ring1][ C]\n",
      "Branch1][# C][N][C][=Branch1][C][=O][",
      "N][C][C][ C][C][",
      "C][C][=N][ N][",
      "Branch2][Ring1][ O][",
      "Branch2][Ring1][= Branch1][C][=Branch1][C][=O][",
      "C][Ring2][Ring1][ Branch1]\n",
      "Ring1][ P]\n",
      "C@@H1][ C][C][N][",
      "C][C][C][Ring1][ Ring1][",
      "[C][C][ C][=",
      "Branch2][Ring1][ C][C][N][C][=Branch1][C][=O][",
      "C][N][ Ring1][Branch1][C][=Branch1][C][=O][",
      "O][ C@H1][",
      "Branch1][P][ N][C][=Branch1][C][=O][",
      "Ring1][= Branch1][C][=Branch1][C][=O][N][",
      "C][C][ O][C][C][",
      "C][=N][ N][",
      "Branch2][Ring1][ Branch1][N][C][=Branch1][C][=O][",
      "C][Ring1][ Branch1][=",
      "Ring1][ S]\n",
      "C][N][Branch2][Ring1][ #",
      "Branch2][Ring1][Ring1][ N][C][=Branch1][C][=O][",
      "[C][C][Branch1][C][C][ Branch1][C][C][",
      "C][=Branch1][C][=O][N][C][C][ C@H1][",
      "C][N][Branch2][Ring1][Ring2][ C][=Branch1][C][=O][",
      "C][C][= C][N][",
      "C][=C][N][= C][C][",
      "N][ N][",
      "C][=C][C][ Branch1][C][Cl][=",
      "Ring1][= Branch1][=",
      "Branch1][= Branch1][C][C][C][Ring1][Ring1][",
      "C][Branch1][ Branch1][C][C][",
      "C@H1][C][C][ C@@H1][",
      "C][C][=Branch1][C][=O][N][C][C][ N][",
      "C][Branch1][C][F][ F][",
      "C][C@][ Branch1][C][C][",
      "Branch1][Ring2][ =",
      "C][ C]\n",
      "C][C][C][Ring1][ Ring1]\n",
      "Ring2][Ring1][ Ring1]\n",
      "Ring1][# Branch2]\n",
      "C][Ring1][ Branch1][C][=Branch1][C][=O][N][",
      "C][C][ Branch1][C][C][Branch1][C][C][",
      "Branch1][S][ N][C][=Branch1][C][=O][",
      "C][Branch1][Ring1][ C][O][",
      "S][ Branch1][C][C][=Branch1][C][=O][",
      "N][=N][ N]["
    ]
  }
}