{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "+": 5,
      "-": 6,
      "/": 7,
      "1": 8,
      "2": 9,
      "=": 10,
      "@": 11,
      "B": 12,
      "C": 13,
      "F": 14,
      "H": 15,
      "I": 16,
      "N": 17,
      "O": 18,
      "P": 19,
      "R": 20,
      "S": 21,
      "[": 22,
      "]": 23,
      "a": 24,
      "c": 25,
      "g": 26,
      "h": 27,
      "i": 28,
      "l": 29,
      "n": 30,
      "r": 31,
      "][": 32,
      "C][": 33,
      "1][": 34,
      "Br": 35,
      "an": 36,
      "ch": 37,
      "Bran": 38,
      "Branch": 39,
      "C][C][": 40,
      "Branch1][": 41,
      "Ri": 42,
      "ng": 43,
      "Ring": 44,
      "C][=": 45,
      "Ring1][": 46,
      "N][": 47,
      "O][": 48,
      "2][": 49,
      "Branch1][C][=": 50,
      "Branch1][C][=O][": 51,
      "C@": 52,
      "H1][": 53,
      "C][C][=": 54,
      "Branch2][": 55,
      "C][=Branch1][C][=O][": 56,
      "Branch1][C][C][": 57,
      "Ring2][": 58,
      "C][Ring1][": 59,
      "C@@": 60,
      "C][N][": 61,
      "C@@H1][": 62,
      "C@H1][": 63,
      "Branch1][C][": 64,
      "Branch2][Ring1][": 65,
      "Ring2][Ring1][": 66,
      "F][": 67,
      "S][": 68,
      "N][C][=Branch1][C][=O][": 69,
      "Ring1][=": 70,
      "C][=C][C][=": 71,
      "N][C][C][": 72,
      "C][C][=Branch1][C][=O][": 73,
      "C][C@H1][": 74,
      "C][Ring1][=": 75,
      "Branch1][=": 76,
      "Branch1][C][F][": 77,
      "C][O][": 78,
      "C][C@@H1][": 79,
      "C][N][C][=Branch1][C][=O][": 80,
      "[C][C][": 81,
      "C][Ring1][#": 82,
      "C][C][C][C][": 83,
      "2]": 84,
      "1]": 85,
      "C]": 86,
      "C][Ring2][Ring1][": 87,
      "Branch1][C][=Branch1][C][=O][": 88,
      "C][=Branch1][C][=O][N][": 89,
      "N][=": 90,
      "P][": 91,
      "C][C][=C][C][=": 92,
      "Ring1][#": 93,
      "C][Branch1][": 94,
      "C][Branch1][C][C][": 95,
      "Branch2]": 96,
      "C][S][": 97,
      "Branch1]": 98,
      "C][N][=": 99,
      "Cl": 100,
      "Branch2][Ring2][": 101,
      "Branch1][C][C][C][C][": 102,
      "[C][O][": 103,
      "C][=C][C][": 104,
      "C][C][=Branch1][C][=O][N][": 105,
      "C][=N][": 106,
      "C][C][=N][": 107,
      "C][=C][C][=C][": 108,
      "C][Ring1][=Branch1][": 109,
      "Branch1][C][O][": 110,
      "Cl][": 111,
      "C][Branch1][C][F][": 112,
      "Branch2][Ring1][#": 113,
      "Branch2][Ring1][=": 114,
      "Branch1][#": 115,
      "Ring1][Branch1][": 116,
      "C][=Branch1][C][=O][N][C][C][": 117,
      "C][C][=Branch1][C][=O][N][C][C][": 118,
      "Ring1][Ring1][": 119,
      "=Branch1][C][=O][": 120,
      "C][Branch1][=": 121,
      "C@@H1][C][C][": 122,
      "NH1][": 123,
      "C][C][=C][C][": 124,
      "Ring1][=Branch1][": 125,
      "C][Ring1][#Branch1][": 126,
      "Branch1][C][Cl][": 127,
      "Branch1][Ring1][": 128,
      "C@@][": 129,
      "C@@H1][Branch1][C][C][": 130,
      "C][C][Ring2][Ring1][": 131,
      "N][Branch1][C][C][": 132,
      "Branch2][Ring1][Ring1][": 133,
      "N]": 134,
      "O]": 135,
      "C@H1][C][C][": 136,
      "#Branch2]": 137,
      "C][Branch2][Ring2][": 138,
      "Branch1][C][=Branch1][C][=O][N][": 139,
      "Branch1][Ring2][": 140,
      "Branch1][C][C][C][Ring1][": 141,
      "C][N][Branch1][": 142,
      "Branch2][Ring1][Ring2][": 143,
      "=N][": 144,
      "[C][N][": 145,
      "O][C][C][": 146,
      "C@][": 147,
      "Branch1][C][F][F][": 148,
      "[C][C][Branch1][C][C][": 149,
      "[C][C@H1][": 150,
      "[C][C@@H1][": 151,
      "Ring1]": 152,
      "C][=C][": 153,
      "Ring1][P][": 154,
      "Branch2][Ring1][Branch2][": 155,
      "Ring1][=Branch2][": 156,
      "C][C@@H1][Ring1][Ring1][": 157,
      "[C][C][=N][": 158,
      "C][C][N][C][=Branch1][C][=O][": 159,
      "Ring2]": 160,
      "Ring1][Branch2][": 161,
      "Ring1][Ring2][": 162,
      "Ring1][=Branch1][C][C][": 163,
      "C][=C][C][=N][": 164,
      "C][=C][C][=C][C][=": 165,
      "C][Ring1][=Branch2][": 166,
      "C][Branch1][C][C][Branch1][C][C][": 167,
      "=Branch2]": 168,
      "[O][": 169,
      "[C][C][=C][C][=": 170,
      "C][#": 171,
      "C][C][N][": 172,
      "C][Ring1][Branch2][": 173,
      "C@H1][Branch1][C][C][": 174,
      "Branch2][Ring1][P][": 175,
      "C][=Branch1][C][=O][N][C][C@H1][": 176,
      "Ring1][#Branch2][": 177,
      "C][Branch1][C][C][=": 178,
      "C][Branch1][=Branch2][": 179,
      "#Branch2][": 180,
      "Branch1][N][C][=Branch1][C][=O][": 181,
      "Ring1][O][": 182,
      "Branch1][=N][": 183,
      "Branch1][=Branch2][": 184,
      "N][=N][": 185,
      "=Branch1][C][=O][=Branch1][C][=O][": 186,
      "F]": 187,
      "P]": 188,
      "[C][=C][C][": 189,
      "[C][C][=C][C][": 190,
      "Br][": 191,
      "C][C][C@@H1][": 192,
      "O][Ring2][Ring1][": 193,
      "Branch1][C][C][Branch1][C][C][": 194,
      "Branch1][C][Br][": 195,
      "C][=C][C][=C][C][": 196,
      "C][Ring1][=Branch1][C][C][": 197,
      "Branch1][#C][C][=Branch1][C][=O][": 198,
      "[O][=": 199,
      "C][Branch1][C][Cl][": 200,
      "C][C][O][": 201,
      "C][C][C][Ring1][": 202,
      "Branch1][S][": 203,
      "C][=Ring1][": 204,
      "C][=C][N][": 205,
      "C][=C][S][": 206,
      "C][=C][N][=": 207,
      "N][C][=": 208,
      "C][C][=C][N][=": 209,
      "Branch2][Ring2][Ring1][": 210,
      "C][Ring1][P][": 211,
      "C@H1][Branch2][Ring1][": 212,
      "Branch1][C][Ring2][Ring1][": 213,
      "N][C][=Branch1][C][=O][N][": 214,
      "Ring1][=Branch1][C][=Branch1][C][=O][": 215,
      "C][Ring2][Ring1][#Branch2]": 216,
      "C][=C][C][=C][Branch1][C][Cl][": 217,
      "C][Branch1][C][F][Branch1][C][F][": 218,
      "C@@][Branch1][C][C][": 219,
      "Branch2][Ring1][Ring1][C][N][C][=Branch1][C][=O][": 220,
      "+1][": 221,
      "=O][": 222,
      "=Branch2][": 223,
      "N+1][": 224,
      "C][Branch2][Ring1][": 225,
      "C][Branch1][C][O][": 226,
      "Branch1][N][": 227,
      "Branch1][P][": 228,
      "C][=C][Ring1][#": 229,
      "Ring1][Branch1][C][C][": 230,
      "N][Branch2][Ring1][": 231,
      "C][C][=C][Ring1][=": 232,
      "C][=Branch1][C][=O][C][C][": 233,
      "C][N][C][C][": 234,
      "C][N][Ring1][": 235,
      "S][C][=": 236,
      "S][=Branch1][C][=O][=Branch1][C][=O][": 237,
      "C][C@H1][Branch1][C][C][": 238,
      "C][C@H1][Ring1][Ring1][": 239,
      "Branch1][=Branch1][C][": 240,
      "C][O][C][C][": 241,
      "C][N][C][=Branch1][C][=O][C][C][": 242,
      "C][C][C][C][Ring1][": 243,
      "Cl]": 244,
      "[C][O][C][=Branch1][C][=O][": 245,
      "C][Branch1][C][F][Branch1][C][F][F][": 246,
      "Branch2][Ring1][#Branch2][": 247,
      "Ring1][Branch1][N][C][=Branch1][C][=O][": 248,
      "NH1][C][=": 249,
      "Branch1][C][=Branch1][C][=O][N][C][C@H1][": 250,
      "Branch2][Ring1][P][C][=Branch1][C][=O][N][": 251,
      "#Branch1]": 252,
      "-1][": 253,
      "=C][C][=": 254,
      "=C][Ring1][#": 255,
      "S]": 256,
      "[C][C][=": 257,
      "[C][S][": 258,
      "[C][#": 259,
      "C][NH1][": 260,
      "C][=C][Ring1][#Branch1][": 261,
      "Branch1][C][C][C][=Branch1][C][=O][": 262,
      "Branch1][C][C][C]": 263,
      "C][Ring1][P]": 264,
      "C][N][Branch1][=": 265,
      "C@@H1][C][C][C][C][": 266,
      "C@H1][C][C@@H1][Ring1][Ring1][": 267,
      "Ring2][Ring1][#Branch2]": 268,
      "N][C][=Branch1][C][=O][C][C][": 269,
      "Ring1][=N][": 270,
      "N][C][C][N][": 271,
      "C][C@@H1][Branch1][C][C][": 272,
      "[C][C][C@H1][": 273,
      "C][Ring1][#Branch2][": 274,
      "C][C][C][C][C][C][": 275,
      "C][Ring2][Ring1][Ring2]": 276,
      "Ring1][#C]": 277,
      "C][Branch1][Ring1][": 278,
      "C][Branch1][C][C][Branch1][C][C][C][C][": 279,
      "C][C][=Branch1][C][=O][N][C][C@H1][": 280,
      "Branch1][#Branch2][": 281,
      "C][C][=Branch1][C][=O][N][C][C][N][": 282,
      "Branch1][Ring1][C][C][": 283,
      "N][Branch1][C][C][C][=Branch1][C][=O][": 284,
      "Branch2][Ring1][Ring1][C][=Branch1][C][=O][": 285,
      "C][N][Branch1][S][": 286,
      "/C][=C][": 287,
      "=C][Ring1][#Branch1][": 288,
      "O-1][": 289,
      "[C][=": 290,
      "C][Branch2][Ring1][#": 291,
      "C][Branch2][Ring1][=": 292,
      "C][C@@][": 293,
      "C][C@][": 294,
      "C][C][Ring1][": 295,
      "C][C][C@H1][": 296,
      "Branch1][C][N][=": 297,
      "C][=C][O][": 298,
      "C][=C][Ring2][Ring1][": 299,
      "Ring1][Branch1]": 300,
      "O][C][=Branch1][C][=O][": 301,
      "O][C]": 302,
      "C][C][=C][Ring2][Ring1][": 303,
      "C][C][=C][Ring1][=Branch1][": 304,
      "C][Ring1][Branch1][C][C][": 305,
      "C][Ring1][S]": 306,
      "C][N][C][=": 307,
      "C][N][Branch1][#C][C][=Branch1][C][=O][": 308,
      "C][N][Branch1][C][C][C][=Branch1][C][=O][": 309,
      "C@@H1][C][C@@H1][Ring1][Ring1][": 310,
      "C@@H1][Ring1][Ring2][": 311,
      "C@H1][C][C@@H1][": 312,
      "C@H1][Branch1][C][O][": 313,
      "Branch2][Ring1][S][": 314,
      "Ring2][Ring1][N]": 315,
      "N][C][=Branch1][C][=O][C][=C][C][": 316,
      "N][C][C][C][C][": 317,
      "C][Ring1][=C]": 318,
      "Branch1][C][F][Branch1][C][F][": 319,
      "C][C@@H1][Branch1][C][O][": 320,
      "[C][C][N][": 321,
      "[C][C][Branch1][C][C][C][C][": 322,
      "C][Ring1][#C]": 323,
      "C][C][C][C][C][Ring1][": 324,
      "Branch1][C][=Branch1][C][=O][N][C][C][": 325,
      "C][=Branch1][C][=O][N][C][C@@H1][": 326,
      "C][C][=C][C][=N][": 327,
      "C][C][=C][C][=C][C][=C][Ring1][=": 328,
      "Ring1][#Branch1][": 329,
      "C][Branch1][#": 330,
      "Branch1][C][C][C][C][N][": 331,
      "[C][O][C][=C][C][=C][": 332,
      "C][Ring1][=Branch1][O][": 333,
      "Branch2][Ring1][=Branch1][C][=Branch1][C][=O][": 334,
      "C][=Branch1][C][=O][N][C][C][N][": 335,
      "C@@H1][C][C][C@H1][": 336,
      "Branch1][Ring1][C][O][": 337,
      "C][N][Branch1][P][": 338,
      "C][=C][NH1][C][=": 339,
      "Branch2][Ring1][Branch2][C][N][C][=Branch1][C][=O][": 340,
      "C][=C][C][=C][C][=Branch1][Ring2][": 341,
      "C@H1][Branch1][C][C][N][C][=Branch1][C][=O][": 342,
      "Branch2][Ring2][Ring1][C][=Branch1][C][=O][N][": 343,
      "C][=C][C][=C][Branch1][C][Cl][C][=C][Ring1][#": 344,
      "C][N][Ring1][Branch1][C][=Branch1][C][=O][": 345,
      "C][N][Branch1][S][C][=Branch1][C][=O][": 346,
      "/C][=C][/": 347,
      "=Branch1]": 348,
      "C][F][": 349,
      "C][C][Ring1][=": 350,
      "C][C][C][C@H1][": 351,
      "C][C][Branch1][C][F][": 352,
      "C][C][C][Branch1][": 353,
      "Branch1][Branch1][C][C][": 354,
      "Branch1][C][C][=Branch1][C][=O][": 355,
      "C][=C][Branch1][C][C][": 356,
      "Ring1][S][": 357,
      "N][Ring2][Ring1][": 358,
      "N][C][C@@H1][": 359,
      "O][C][=": 360,
      "O][C][Ring2][Ring1][": 361,
      "Branch1][C][=N][": 362,
      "Ring2][C][C][": 363,
      "C][Ring1][Branch1][": 364,
      "C][N][Ring1][Branch1][": 365,
      "C@@H1][C][N][": 366,
      "C@@H1][Ring2][Ring1][": 367,
      "C@@H1][Ring1][=": 368,
      "C@@H1][Branch2][Ring2][": 369,
      "C@H1][Branch2][Ring1][#": 370,
      "C@H1][Branch2][Ring1][Ring1][C][N][C][=Branch1][C][=O][": 371,
      "C@H1][C][C@H1][Ring1][Ring1][": 372,
      "Branch2][Ring1][C][C][=Branch1][C][=O][": 373,
      "Branch2][Ring1][C][N][C][=Branch1][C][=O][": 374,
      "Ring2][Ring1][O]": 375,
      "Ring2][Ring1][#Branch1]": 376,
      "S][Ring1][=": 377,
      "N][C][=Branch1][C][=O][C][=C][C][=C][": 378,
      "N][C][=Branch1][C][=O][C@H1][C][C][": 379,
      "N][C][=Branch1][C][=O][C][Branch1][=Branch2][": 380,
      "N][C][=Branch1][C][=O][C@H1][C][C@@H1][Ring1][Ring1][": 381,
      "C][=C][C][=C][O][": 382,
      "C][=C][C][=C][S][": 383,
      "C][=C][C][=C][C][=N][": 384,
      "N][C][C][O][C][C][": 385,
      "C][C@H1][Ring1][P][": 386,
      "Branch1][=Branch1][C][C][C][Ring1][": 387,
      "C][O][C][=Ring1][": 388,
      "C][N][C][=Branch1][C][=O][C][=C][C][=C][C][=": 389,
      "[C][C][O][": 390,
      "[C][C][C@@H1][": 391,
      "C][C][C][C][N][": 392,
      "C][Ring2][Ring1][Branch1]": 393,
      "N][=C][C][": 394,
      "N][=C][Ring1][": 395,
      "C][C][=C][C][=C][N][=": 396,
      "Ring1][#Branch1]": 397,
      "Ring1][#C][C][Ring2][Ring1][": 398,
      "C][S][=Branch1][C][=O][=Branch1][C][=O][": 399,
      "Branch2][Ring2][Ring2][": 400,
      "[C][O][C][=C][C][": 401,
      "C][=C][C][Branch1][C][F][": 402,
      "C][C][=Branch1][C][=O][N][C@@H1][": 403,
      "C][=C][C][=C][Branch1][C][Br][": 404,
      "C][Branch1][C][F][F][": 405,
      "Branch2][Ring1][=Branch2][": 406,
      "Branch2][Ring1][=C][C][=Branch1][C][=O][N][": 407,
      "C][Branch1][=Branch1][": 408,
      "C][Branch1][=Branch1][C][C][C][Ring1][": 409,
      "C][Ring1][#Branch1][F][": 410,
      "Branch1][Ring1][O][": 411,
      "C][C][Ring2][Ring1][=Branch2]": 412,
      "N][Branch1][C][C][C][=": 413,
      "C@H1][C][C][C@H1][Branch2][Ring1][": 414,
      "Branch1][Ring2][C][C][": 415,
      "Branch1][C][C][C][Ring1][Ring1][": 416,
      "Branch2][Ring1][Ring2][C][N][C][=Branch1][C][=O][": 417,
      "=N][Ring1][=Branch1][C][C][": 418,
      "C@][Branch1][C][C][": 419,
      "C][=Branch1][C][=O][N][C][C@H1][Branch1][C][C][": 420,
      "O][Ring2][Ring1][O]": 421,
      "[O][=C][Branch1][=": 422,
      "C][C][C][Ring1][Ring1]": 423,
      "Branch1][S][N][C][=Branch1][C][=O][": 424,
      "N+1][=Branch1][C][=O][": 425,
      "C][Branch2][Ring1][O][": 426,
      "N][Branch2][Ring1][C][C][=Branch1][C][=O][": 427,
      "C][C][C][C][Ring1][Ring2]": 428,
      "=C][Ring1][#Branch1][C][C][": 429,
      "C][N][Branch1][=C][C][=Branch1][C][=O][": 430,
      "N][C][C][N][Branch1][#C][C][=Branch1][C][=O][": 431,
      "C][C@@][Branch1][C][O][": 432,
      "C][N][Branch1][P][C][=Branch1][C][=O][": 433,
      "C][=C][C][=C][C][=Branch1][Ring2][=": 434,
      "Branch1][C][C][=Branch1][C][=O][=O][": 435,
      "=C][Ring1][Branch2][": 436,
      "=Branch1][C][=Branch1][C][=O][N][C][C@H1][": 437,
      "=Branch1][C][=Branch1][C][=O][N][C][C][": 438,
      "[C][C][=Branch1][C][=O][N][": 439,
      "[N][C][=Branch1][C][=O][C][=C][C][=C][": 440,
      "C][Branch2][Ring2][Ring1][C][=Branch1][C][=O][N][": 441,
      "C][/C][=C][/": 442,
      "C][Branch2][Ring1][Ring2][C][N][C][=Branch1][C][=O][": 443,
      "C][C][Branch1][C][C][": 444,
      "C][C][C][O][": 445,
      "C][C][C][C@@H1][": 446,
      "C][C][C][N][C][=Branch1][C][=O][": 447,
      "C][C][Ring1][#": 448,
      "C][C][C][=Branch1][C][=O][N][C][C][": 449,
      "C][C][C@@H1][Branch1][C][C][": 450,
      "C][C][C][=Branch1][C][=O][N][C][C@H1][Branch1][C][C][": 451,
      "Branch1][O][": 452,
      "Branch1][C][C][=": 453,
      "Branch1][C][C][=C][C][": 454,
      "C][=C][Branch1][C][F][": 455,
      "C][=C][Branch1][=Branch2][": 456,
      "C][=C][Ring2][Ring1][#Branch2]": 457,
      "Ring1][N][": 458,
      "Ring1][Branch1][C][": 459,
      "Ring1][C][Ring1][=": 460,
      "Ring1][C]": 461,
      "Ring1][N]": 462,
      "Ring1][Branch1][C][=Branch1][C][=O][N][": 463,
      "N][C@@H1][": 464,
      "N][Ring1][=": 465,
      "N][Ring1][Branch1][": 466,
      "N][C][=C][C][=N][": 467,
      "N][N][=N][": 468,
      "N][C@@H1][C][C][C][C][": 469,
      "N][Branch2][Ring1][Ring1][C][=Branch1][C][=O][": 470,
      "O][C@H1][": 471,
      "O][C][C@H1][": 472,
      "O][C][C@@H1][": 473,
      "O][C][Ring1][#": 474,
      "O][Ring1][#Branch2][": 475,
      "Branch1][C][=O][=O][": 476,
      "C][C][=C][NH1][": 477,
      "Branch2][C][=Branch1][C][=O][N][C][C][": 478,
      "C][=Branch1][C][=O][C@H1][": 479,
      "Branch1][C][C][O][": 480,
      "Branch1][C][C][Ring2][Ring1][": 481,
      "Branch1][C][C][Branch1][C][F][F][": 482,
      "Branch1][C][C][C][Branch1][C][O][": 483,
      "Branch1][C][C][Branch1][C][C][=": 484,
      "Ring2][C][Ring2][Ring1][": 485,
      "C][Ring1][Branch2]": 486,
      "C][Ring1][Branch1][C][=Branch1][C][=O][N][C][C@H1][": 487,
      "C][N][Ring1][=Branch1][C][=Branch1][C][=O][": 488,
      "C@@H1][Branch2][Ring1][": 489,
      "C@@H1][Ring1][=Branch1][": 490,
      "C@H1][Ring1][=Branch1][": 491,
      "Branch1][C][C@H1][": 492,
      "Branch2][Ring1][N][C][C@@H1][": 493,
      "Ring2][Ring1][Branch1]": 494,
      "Ring2][Ring1][=Branch2]": 495,
      "Ring2][Ring1][#Branch2][": 496,
      "S][Ring2][Ring1][#Branch2]": 497,
      "S][Branch1][C][N][=": 498,
      "S][Branch1][C][C][=Branch1][C][=O][=O][": 499
    },
    "merges": [
      "] [",
      "C ][",
      "1 ][",
      "B r",
      "a n",
      "c h",
      "Br an",
      "Bran ch",
      "C][ C][",
      "Branch 1][",
      "R i",
      "n g",
      "Ri ng",
      "C][ =",
      "Ring 1][",
      "N ][",
      "O ][",
      "2 ][",
      "Branch1][ C][=",
      "Branch1][C][= O][",
      "C @",
      "H 1][",
      "C][C][ =",
      "Branch 2][",
      "C][= Branch1][C][=O][",
      "Branch1][ C][C][",
      "Ring 2][",
      "C][ Ring1][",
      "C@ @",
      "C][ N][",
      "C@@ H1][",
      "C@ H1][",
      "Branch1][ C][",
      "Branch2][ Ring1][",
      "Ring2][ Ring1][",
      "F ][",
      "S ][",
      "N][ C][=Branch1][C][=O][",
      "Ring1][ =",
      "C][= C][C][=",
      "N][ C][C][",
      "C][C][= Branch1][C][=O][",
      "C][ C@H1][",
      "C][Ring1][ =",
      "Branch1][ =",
      "Branch1][C][ F][",
      "C][ O][",
      "C][ C@@H1][",
      "C][N][ C][=Branch1][C][=O][",
      "[ C][C][",
      "C][Ring1][ #",
      "C][C][ C][C][",
      "2 ]",
      "1 ]",
      "C ]",
      "C][ Ring2][Ring1][",
      "Branch1][C][= Branch1][C][=O][",
      "C][=Branch1][C][=O][ N][",
      "N][ =",
      "P ][",
      "C][C][= C][C][=",
      "Ring1][ #",
      "C][ Branch1][",
      "C][ Branch1][C][C][",
      "Branch 2]",
      "C][ S][",
      "Branch 1]",
      "C][N][ =",
      "C l",
      "Branch2][ Ring2][",
      "Branch1][C][C][ C][C][",
      "[ C][O][",
      "C][= C][C][",
      "C][C][=Branch1][C][=O][ N][",
      "C][= N][",
      "C][C][= N][",
      "C][=C][C][= C][",
      "C][Ring1][= Branch1][",
      "Branch1][C][ O][",
      "Cl ][",
      "C][ Branch1][C][F][",
      "Branch2][Ring1][ #",
      "Branch2][Ring1][ =",
      "Branch1][ #",
      "Ring1][ Branch1][",
      "C][=Branch1][C][=O][ N][C][C][",
      "C][C][=Branch1][C][=O][ N][C][C][",
      "Ring1][ Ring1][",
      "= Branch1][C][=O][",
      "C][ Branch1][=",
      "C@@H1][ C][C][",
      "N H1][",
      "C][C][= C][C][",
      "Ring1][= Branch1][",
      "C][Ring1][# Branch1][",
      "Branch1][C][ Cl][",
      "Branch1][ Ring1][",
      "C@@ ][",
      "C@@H1][ Branch1][C][C][",
      "C][C][ Ring2][Ring1][",
      "N][ Branch1][C][C][",
      "Branch2][Ring1][ Ring1][",
      "N ]",
      "O ]",
      "C@H1][ C][C][",
      "# Branch2]",
      "C][ Branch2][Ring2][",
      "Branch1][C][=Branch1][C][=O][ N][",
      "Branch1][ Ring2][",
      "Branch1][C][C][ C][Ring1][",
      "C][N][ Branch1][",
      "Branch2][Ring1][ Ring2][",
      "= N][",
      "[ C][N][",
      "O][ C][C][",
      "C@ ][",
      "Branch1][C][F][ F][",
      "[C][C][ Branch1][C][C][",
      "[ C][C@H1][",
      "[ C][C@@H1][",
      "Ring 1]",
      "C][= C][",
      "Ring1][ P][",
      "Branch2][Ring1][ Branch2][",
      "Ring1][= Branch2][",
      "C][C@@H1][ Ring1][Ring1][",
      "[ C][C][=N][",
      "C][C][ N][C][=Branch1][C][=O][",
      "Ring 2]",
      "Ring1][ Branch2][",
      "Ring1][ Ring2][",
      "Ring1][= Branch1][C][C][",
      "C][=C][C][= N][",
      "C][=C][C][= C][C][=",
      "C][Ring1][= Branch2][",
      "C][Branch1][C][C][ Branch1][C][C][",
      "= Branch2]",
      "[ O][",
      "[ C][C][=C][C][=",
      "C][ #",
      "C][C][ N][",
      "C][Ring1][ Branch2][",
      "C@H1][ Branch1][C][C][",
      "Branch2][Ring1][ P][",
      "C][=Branch1][C][=O][N][ C][C@H1][",
      "Ring1][# Branch2][",
      "C][Branch1][ C][C][=",
      "C][Branch1][= Branch2][",
      "# Branch2][",
      "Branch1][ N][C][=Branch1][C][=O][",
      "Ring1][ O][",
      "Branch1][= N][",
      "Branch1][= Branch2][",
      "N][= N][",
      "=Branch1][C][=O][ =Branch1][C][=O][",
      "F ]",
      "P ]",
      "[ C][=C][C][",
      "[ C][C][=C][C][",
      "Br ][",
      "C][C][ C@@H1][",
      "O][ Ring2][Ring1][",
      "Branch1][C][C][ Branch1][C][C][",
      "Branch1][C][ Br][",
      "C][=C][C][= C][C][",
      "C][Ring1][= Branch1][C][C][",
      "Branch1][# C][C][=Branch1][C][=O][",
      "[O][ =",
      "C][ Branch1][C][Cl][",
      "C][C][ O][",
      "C][C][ C][Ring1][",
      "Branch1][ S][",
      "C][= Ring1][",
      "C][= C][N][",
      "C][= C][S][",
      "C][= C][N][=",
      "N][ C][=",
      "C][C][= C][N][=",
      "Branch2][ Ring2][Ring1][",
      "C][Ring1][ P][",
      "C@H1][ Branch2][Ring1][",
      "Branch1][C][ Ring2][Ring1][",
      "N][C][=Branch1][C][=O][ N][",
      "Ring1][= Branch1][C][=Branch1][C][=O][",
      "C][Ring2][Ring1][ #Branch2]",
      "C][=C][C][=C][ Branch1][C][Cl][",
      "C][Branch1][C][F][ Branch1][C][F][",
      "C@@][ Branch1][C][C][",
      "Branch2][Ring1][Ring1][ C][N][C][=Branch1][C][=O][",
      "+ 1][",
      "= O][",
      "= Branch2][",
      "N +1][",
      "C][ Branch2][Ring1][",
      "C][ Branch1][C][O][",
      "Branch1][ N][",
      "Branch1][ P][",
      "C][= C][Ring1][#",
      "Ring1][ Branch1][C][C][",
      "N][ Branch2][Ring1][",
      "C][C][= C][Ring1][=",
      "C][=Branch1][C][=O][ C][C][",
      "C][N][ C][C][",
      "C][N][ Ring1][",
      "S][ C][=",
      "S][ =Branch1][C][=O][=Branch1][C][=O][",
      "C][C@H1][ Branch1][C][C][",
      "C][C@H1][ Ring1][Ring1][",
      "Branch1][= Branch1][C][",
      "C][O][ C][C][",
      "C][N][C][=Branch1][C][=O][ C][C][",
      "C][C][C][C][ Ring1][",
      "Cl ]",
      "[C][O][ C][=Branch1][C][=O][",
      "C][Branch1][C][F][ Branch1][C][F][F][",
      "Branch2][Ring1][# Branch2][",
      "Ring1][Branch1][ N][C][=Branch1][C][=O][",
      "NH1][ C][=",
      "Branch1][C][=Branch1][C][=O][N][ C][C@H1][",
      "Branch2][Ring1][P][ C][=Branch1][C][=O][N][",
      "# Branch1]",
      "- 1][",
      "= C][C][=",
      "= C][Ring1][#",
      "S ]",
      "[ C][C][=",
      "[ C][S][",
      "[ C][#",
      "C][ NH1][",
      "C][= C][Ring1][#Branch1][",
      "Branch1][C][C][ C][=Branch1][C][=O][",
      "Branch1][C][C][ C]",
      "C][Ring1][ P]",
      "C][N][ Branch1][=",
      "C@@H1][ C][C][C][C][",
      "C@H1][ C][C@@H1][Ring1][Ring1][",
      "Ring2][Ring1][ #Branch2]",
      "N][C][=Branch1][C][=O][ C][C][",
      "Ring1][= N][",
      "N][C][C][ N][",
      "C][C@@H1][ Branch1][C][C][",
      "[C][C][ C@H1][",
      "C][Ring1][# Branch2][",
      "C][C][C][C][ C][C][",
      "C][Ring2][Ring1][ Ring2]",
      "Ring1][# C]",
      "C][Branch1][ Ring1][",
      "C][Branch1][C][C][ Branch1][C][C][C][C][",
      "C][C][=Branch1][C][=O][N][ C][C@H1][",
      "Branch1][# Branch2][",
      "C][C][=Branch1][C][=O][N][C][C][ N][",
      "Branch1][Ring1][ C][C][",
      "N][Branch1][C][C][ C][=Branch1][C][=O][",
      "Branch2][Ring1][Ring1][ C][=Branch1][C][=O][",
      "C][N][Branch1][ S][",
      "/ C][=C][",
      "= C][Ring1][#Branch1][",
      "O -1][",
      "[ C][=",
      "C][ Branch2][Ring1][#",
      "C][ Branch2][Ring1][=",
      "C][ C@@][",
      "C][ C@][",
      "C][C][ Ring1][",
      "C][C][ C@H1][",
      "Branch1][ C][N][=",
      "C][= C][O][",
      "C][= C][Ring2][Ring1][",
      "Ring1][ Branch1]",
      "O][ C][=Branch1][C][=O][",
      "O][ C]",
      "C][C][= C][Ring2][Ring1][",
      "C][C][= C][Ring1][=Branch1][",
      "C][Ring1][ Branch1][C][C][",
      "C][Ring1][ S]",
      "C][N][ C][=",
      "C][N][ Branch1][#C][C][=Branch1][C][=O][",
      "C][N][ Branch1][C][C][C][=Branch1][C][=O][",
      "C@@H1][ C][C@@H1][Ring1][Ring1][",
      "C@@H1][ Ring1][Ring2][",
      "C@H1][ C][C@@H1][",
      "C@H1][ Branch1][C][O][",
      "Branch2][Ring1][ S][",
      "Ring2][Ring1][ N]",
      "N][C][=Branch1][C][=O][ C][=C][C][",
      "N][C][C][ C][C][",
      "C][Ring1][= C]",
      "Branch1][C][F][ Branch1][C][F][",
      "C][C@@H1][ Branch1][C][O][",
      "[C][C][ N][",
      "[C][C][ Branch1][C][C][C][C][",
      "C][Ring1][# C]",
      "C][C][C][C][ C][Ring1][",
      "Branch1][C][=Branch1][C][=O][ N][C][C][",
      "C][=Branch1][C][=O][N][ C][C@@H1][",
      "C][C][=C][C][= N][",
      "C][C][=C][C][= C][C][=C][Ring1][=",
      "Ring1][# Branch1][",
      "C][Branch1][ #",
      "Branch1][C][C][C][C][ N][",
      "[C][O][ C][=C][C][=C][",
      "C][Ring1][=Branch1][ O][",
      "Branch2][Ring1][= Branch1][C][=Branch1][C][=O][",
      "C][=Branch1][C][=O][N][C][C][ N][",
      "C@@H1][C][C][ C@H1][",
      "Branch1][Ring1][ C][O][",
      "C][N][Branch1][ P][",
      "C][=C][ NH1][C][=",
      "Branch2][Ring1][Branch2][ C][N][C][=Branch1][C][=O][",
      "C][=C][C][=C][C][= Branch1][Ring2][",
      "C@H1][Branch1][C][C][ N][C][=Branch1][C][=O][",
      "Branch2][Ring2][Ring1][ C][=Branch1][C][=O][N][",
      "C][=C][C][=C][Branch1][C][Cl][ C][=C][Ring1][#",
      "C][N][Ring1][ Branch1][C][=Branch1][C][=O][",
      "C][N][Branch1][S][ C][=Branch1][C][=O][",
      "/C][=C][ /",
      "= Branch1]",
      "C][ F][",
      "C][C][ Ring1][=",
      "C][C][ C][C@H1][",
      "C][C][ Branch1][C][F][",
      "C][C][ C][Branch1][",
      "Branch1][ Branch1][C][C][",
      "Branch1][ C][C][=Branch1][C][=O][",
      "C][= C][Branch1][C][C][",
      "Ring1][ S][",
      "N][ Ring2][Ring1][",
      "N][ C][C@@H1][",
      "O][ C][=",
      "O][ C][Ring2][Ring1][",
      "Branch1][C][= N][",
      "Ring2][ C][C][",
      "C][Ring1][ Branch1][",
      "C][N][ Ring1][Branch1][",
      "C@@H1][ C][N][",
      "C@@H1][ Ring2][Ring1][",
      "C@@H1][ Ring1][=",
      "C@@H1][ Branch2][Ring2][",
      "C@H1][ Branch2][Ring1][#",
      "C@H1][ Branch2][Ring1][Ring1][C][N][C][=Branch1][C][=O][",
      "C@H1][ C][C@H1][Ring1][Ring1][",
      "Branch2][Ring1][ C][C][=Branch1][C][=O][",
      "Branch2][Ring1][ C][N][C][=Branch1][C][=O][",
      "Ring2][Ring1][ O]",
      "Ring2][Ring1][ #Branch1]",
      "S][ Ring1][=",
      "N][C][=Branch1][C][=O][ C][=C][C][=C][",
      "N][C][=Branch1][C][=O][ C@H1][C][C][",
      "N][C][=Branch1][C][=O][ C][Branch1][=Branch2][",
      "N][C][=Branch1][C][=O][ C@H1][C][C@@H1][Ring1][Ring1][",
      "C][=C][C][= C][O][",
      "C][=C][C][= C][S][",
      "C][=C][C][= C][C][=N][",
      "N][C][C][ O][C][C][",
      "C][C@H1][ Ring1][P][",
      "Branch1][= Branch1][C][C][C][Ring1][",
      "C][O][ C][=Ring1][",
      "C][N][C][=Branch1][C][=O][ C][=C][C][=C][C][=",
      "[C][C][ O][",
      "[C][C][ C@@H1][",
      "C][C][C][C][ N][",
      "C][Ring2][Ring1][ Branch1]",
      "N][= C][C][",
      "N][= C][Ring1][",
      "C][C][=C][C][= C][N][=",
      "Ring1][# Branch1]",
      "Ring1][# C][C][Ring2][Ring1][",
      "C][S][ =Branch1][C][=O][=Branch1][C][=O][",
      "Branch2][Ring2][ Ring2][",
      "[C][O][ C][=C][C][",
      "C][=C][C][ Branch1][C][F][",
      "C][C][=Branch1][C][=O][N][ C@@H1][",
      "C][=C][C][=C][ Branch1][C][Br][",
      "C][Branch1][C][F][ F][",
      "Branch2][Ring1][= Branch2][",
      "Branch2][Ring1][= C][C][=Branch1][C][=O][N][",
      "C][Branch1][= Branch1][",
      "C][Branch1][= Branch1][C][C][C][Ring1][",
      "C][Ring1][#Branch1][ F][",
      "Branch1][Ring1][ O][",
      "C][C][Ring2][Ring1][ =Branch2]",
      "N][Branch1][C][C][ C][=",
      "C@H1][C][C][ C@H1][Branch2][Ring1][",
      "Branch1][Ring2][ C][C][",
      "Branch1][C][C][C][Ring1][ Ring1][",
      "Branch2][Ring1][Ring2][ C][N][C][=Branch1][C][=O][",
      "=N][ Ring1][=Branch1][C][C][",
      "C@][ Branch1][C][C][",
      "C][=Branch1][C][=O][N][C][C@H1][ Branch1][C][C][",
      "O][Ring2][Ring1][ O]",
      "[O][= C][Branch1][=",
      "C][C][C][Ring1][ Ring1]",
      "Branch1][S][ N][C][=Branch1][C][=O][",
      "N+1][ =Branch1][C][=O][",
      "C][Branch2][Ring1][ O][",
      "N][Branch2][Ring1][ C][C][=Branch1][C][=O][",
      "C][C][C][C][Ring1][ Ring2]",
      "=C][Ring1][# Branch1][C][C][",
      "C][N][Branch1][= C][C][=Branch1][C][=O][",
      "N][C][C][N][ Branch1][#C][C][=Branch1][C][=O][",
      "C][C@@][ Branch1][C][O][",
      "C][N][Branch1][P][ C][=Branch1][C][=O][",
      "C][=C][C][=C][C][=Branch1][Ring2][ =",
      "Branch1][C][C][=Branch1][C][=O][ =O][",
      "= C][Ring1][Branch2][",
      "= Branch1][C][=Branch1][C][=O][N][C][C@H1][",
      "= Branch1][C][=Branch1][C][=O][N][C][C][",
      "[ C][C][=Branch1][C][=O][N][",
      "[ N][C][=Branch1][C][=O][C][=C][C][=C][",
      "C][ Branch2][Ring2][Ring1][C][=Branch1][C][=O][N][",
      "C][ /C][=C][/",
      "C][ Branch2][Ring1][Ring2][C][N][C][=Branch1][C][=O][",
      "C][C][ Branch1][C][C][",
      "C][C][ C][O][",
      "C][C][ C][C@@H1][",
      "C][C][ C][N][C][=Branch1][C][=O][",
      "C][C][ Ring1][#",
      "C][C][ C][=Branch1][C][=O][N][C][C][",
      "C][C][ C@@H1][Branch1][C][C][",
      "C][C][ C][=Branch1][C][=O][N][C][C@H1][Branch1][C][C][",
      "Branch1][ O][",
      "Branch1][ C][C][=",
      "Branch1][ C][C][=C][C][",
      "C][= C][Branch1][C][F][",
      "C][= C][Branch1][=Branch2][",
      "C][= C][Ring2][Ring1][#Branch2]",
      "Ring1][ N][",
      "Ring1][ Branch1][C][",
      "Ring1][ C][Ring1][=",
      "Ring1][ C]",
      "Ring1][ N]",
      "Ring1][ Branch1][C][=Branch1][C][=O][N][",
      "N][ C@@H1][",
      "N][ Ring1][=",
      "N][ Ring1][Branch1][",
      "N][ C][=C][C][=N][",
      "N][ N][=N][",
      "N][ C@@H1][C][C][C][C][",
      "N][ Branch2][Ring1][Ring1][C][=Branch1][C][=O][",
      "O][ C@H1][",
      "O][ C][C@H1][",
      "O][ C][C@@H1][",
      "O][ C][Ring1][#",
      "O][ Ring1][#Branch2][",
      "Branch1][C][=O][ =O][",
      "C][C][= C][NH1][",
      "Branch2][ C][=Branch1][C][=O][N][C][C][",
      "C][=Branch1][C][=O][ C@H1][",
      "Branch1][C][C][ O][",
      "Branch1][C][C][ Ring2][Ring1][",
      "Branch1][C][C][ Branch1][C][F][F][",
      "Branch1][C][C][ C][Branch1][C][O][",
      "Branch1][C][C][ Branch1][C][C][=",
      "Ring2][ C][Ring2][Ring1][",
      "C][Ring1][ Branch2]",
      "C][Ring1][ Branch1][C][=Branch1][C][=O][N][C][C@H1][",
      "C][N][ Ring1][=Branch1][C][=Branch1][C][=O][",
      "C@@H1][ Branch2][Ring1][",
      "C@@H1][ Ring1][=Branch1][",
      "C@H1][ Ring1][=Branch1][",
      "Branch1][C][ C@H1][",
      "Branch2][Ring1][ N][C][C@@H1][",
      "Ring2][Ring1][ Branch1]",
      "Ring2][Ring1][ =Branch2]",
      "Ring2][Ring1][ #Branch2][",
      "S][ Ring2][Ring1][#Branch2]",
      "S][ Branch1][C][N][=",
      "S][ Branch1][C][C][=Branch1][C][=O][=O]["
    ]
  }
}