{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "C": 4,
      "(": 5,
      ")": 6,
      "c": 7,
      "1": 8,
      "O": 9,
      "=": 10,
      "N": 11,
      "2": 12,
      "n": 13,
      "[C@H]": 14,
      "[C@@H]": 15,
      "3": 16,
      "F": 17,
      "S": 18,
      "s": 19,
      "4": 20,
      "Cl": 21,
      "[nH]": 22,
      "o": 23,
      "[C@]": 24,
      "[C@@]": 25,
      "#": 26,
      "Br": 27,
      "-": 28,
      "/": 29,
      "[N+]": 30,
      "[O-]": 31,
      "5": 32,
      "I": 33,
      "[N-]": 34,
      "P": 35,
      "[S@]": 36,
      "[S@@]": 37,
      "[n+]": 38,
      "[Si]": 39,
      "6": 40,
      "[S+]": 41,
      "B": 42,
      "[P@]": 43,
      "7": 44,
      "[P@@]": 45,
      "[N@]": 46,
      "8": 47,
      "[N@@]": 48,
      "[B-]": 49,
      "[NH+]": 50,
      "[N@@H+]": 51,
      "[NH2+]": 52,
      "[N@H+]": 53,
      "[O]": 54,
      "[NH3+]": 55,
      "[PH]": 56,
      "[Si@]": 57,
      "[Si@@]": 58,
      "[n-]": 59,
      "9": 60,
      "[N@+]": 61,
      "[nH+]": 62,
      "[N@@+]": 63,
      "[Sn]": 64,
      "[s+]": 65,
      "[Se]": 66,
      ".": 67,
      "[Cl-]": 68,
      "[N]": 69,
      "[C-]": 70,
      "[C]": 71,
      "[S@@+]": 72,
      "%10": 73,
      "%11": 74,
      "[O+]": 75,
      "[SH]": 76,
      "[Si@H]": 77,
      "[NH]": 78,
      "[P+]": 79,
      "[P@@H]": 80,
      "[Si@@H]": 81,
      "[c-]": 82,
      "[o+]": 83
    },
    "unk_token": "<unk>"
  }
}