{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "]": 32,
      "c": 33,
      "e": 34,
      "i": 35,
      "l": 36,
      "n": 37,
      "o": 38,
      "r": 39,
      "s": 40,
      "%1": 41,
      "%10": 42,
      "%11": 43,
      "Cl": 44,
      "[n": 45,
      "H]": 46,
      "[nH]": 47,
      "Br": 48,
      "%12": 49,
      "[N": 50,
      "+]": 51,
      "-]": 52,
      "[N+]": 53,
      "[O": 54,
      "[O-]": 55,
      "%13": 56,
      "[N-]": 57,
      "[n+]": 58,
      "%14": 59,
      "[S": 60,
      "[Si": 61,
      "[Si]": 62,
      "[S+]": 63,
      "%15": 64,
      "%16": 65,
      "[NH": 66,
      "[NH+]": 67,
      "B-]": 68,
      "[B-]": 69,
      "%17": 70,
      "2+]": 71,
      "[NH2+]": 72,
      "[O]": 73,
      "[P": 74,
      "3+]": 75,
      "[NH3+]": 76,
      "[PH]": 77,
      "[n-]": 78,
      "%18": 79,
      "H+]": 80,
      "[nH+]": 81,
      "n]": 82,
      "[Sn]": 83,
      "[s": 84,
      "[s+]": 85,
      "%19": 86,
      "e]": 87,
      "[Se]": 88,
      "[Cl": 89,
      "[Cl-]": 90,
      "%2": 91,
      "%20": 92,
      "[C": 93,
      "[N]": 94,
      "[C]": 95,
      "[C-]": 96,
      "[SiH]": 97,
      "[O+]": 98,
      "[SH]": 99,
      "%21": 100,
      "[c": 101,
      "[o": 102,
      "[NH]": 103,
      "[P+]": 104,
      "[c-]": 105,
      "[o+]": 106
    },
    "merges": [
      "% 1",
      "%1 0",
      "%1 1",
      "C l",
      "[ n",
      "H ]",
      "[n H]",
      "B r",
      "%1 2",
      "[ N",
      "+ ]",
      "- ]",
      "[N +]",
      "[ O",
      "[O -]",
      "%1 3",
      "[N -]",
      "[n +]",
      "%1 4",
      "[ S",
      "[S i",
      "[Si ]",
      "[S +]",
      "%1 5",
      "%1 6",
      "[N H",
      "[NH +]",
      "B -]",
      "[ B-]",
      "%1 7",
      "2 +]",
      "[NH 2+]",
      "[O ]",
      "[ P",
      "3 +]",
      "[NH 3+]",
      "[P H]",
      "[n -]",
      "%1 8",
      "H +]",
      "[n H+]",
      "n ]",
      "[S n]",
      "[ s",
      "[s +]",
      "%1 9",
      "e ]",
      "[S e]",
      "[ Cl",
      "[Cl -]",
      "% 2",
      "%2 0",
      "[ C",
      "[N ]",
      "[C ]",
      "[C -]",
      "[Si H]",
      "[O +]",
      "[S H]",
      "%2 1",
      "[ c",
      "[ o",
      "[N H]",
      "[P +]",
      "[c -]",
      "[o +]"
    ]
  }
}