{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "=": 22,
      "@": 23,
      "B": 24,
      "C": 25,
      "F": 26,
      "H": 27,
      "I": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "S": 32,
      "[": 33,
      "\\": 34,
      "]": 35,
      "c": 36,
      "e": 37,
      "i": 38,
      "l": 39,
      "n": 40,
      "o": 41,
      "r": 42,
      "s": 43,
      "CC": 44,
      "O)": 45,
      "(C": 46,
      "=O)": 47,
      "cc": 48,
      "(=O)": 49,
      "[C": 50,
      "[C@": 51,
      "H]": 52,
      ")C": 53,
      "c1": 54,
      "C(=O)": 55,
      "[C@@": 56,
      "[C@H]": 57,
      "[C@@H]": 58,
      "(C)": 59,
      "(C(=O)": 60,
      "NC(=O)": 61,
      "c2": 62,
      "CCC": 63,
      "F)": 64,
      "c1cc": 65,
      "(C)C": 66,
      "1CC": 67,
      "N(C(=O)": 68,
      "(F)": 69,
      "2)": 70,
      "1C": 71,
      "(=O)N": 72,
      "cn": 73,
      "(C(=O)N": 74,
      "c3": 75,
      "2CC": 76,
      "(CC": 77,
      ")C1": 78,
      "2C": 79,
      "c2cc": 80,
      "=C": 81,
      "C(=O)N": 82,
      "CC1": 83,
      "c(": 84,
      "OC": 85,
      "NC(=O)C": 86,
      "n1": 87,
      "[n": 88,
      "[nH]": 89,
      "c(C": 90,
      "l)": 91,
      "C[C@@H]": 92,
      "(O)": 93,
      "C[C@H]": 94,
      "3)": 95,
      "CC(=O)N": 96,
      "(N": 97,
      "(NC(=O)": 98,
      "CO": 99,
      "2)C1": 100,
      "1CCC": 101,
      "c1n": 102,
      "cc1": 103,
      "Cc1cc": 104,
      "c3cc": 105,
      "c(C(=O)N": 106,
      ")C2)": 107,
      "[C@]": 108,
      "CCCC": 109,
      "O=C": 110,
      "2CCC": 111,
      "[C@@]": 112,
      "N(C(=O)C": 113,
      "(CNC(=O)": 114,
      "CCN": 115,
      "CCO": 116,
      "[C@H]1C": 117,
      "CC(C)": 118,
      "ccc1": 119,
      "[C@@H]1C": 120,
      "c(C)": 121,
      "nn": 122,
      "[C@H]2C": 123,
      "c(Cl)": 124,
      "3CC": 125,
      "1)": 126,
      "N(C)C": 127,
      "c1cn": 128,
      "[C@@H]2C": 129,
      "F)C": 130,
      "Br": 131,
      "2)C": 132,
      "(F)(F)": 133,
      "c(F)": 134,
      "(C)(C)C": 135,
      "c2cccc": 136,
      "cs": 137,
      "[C@H](C)": 138,
      "[C@@H](C)": 139,
      "c4": 140,
      "3C": 141,
      "C1": 142,
      ")CC": 143,
      "(NC(=O)C": 144,
      "[C@H]1": 145,
      "ncc": 146,
      "CN": 147,
      "(Cl)": 148,
      "Br)": 149,
      "C=C": 150,
      "[C@@H]1CC": 151,
      "[C@H]1CC": 152,
      "3)C2)": 153,
      "(CC(=O)N": 154,
      "1C(=O)": 155,
      "1)C": 156,
      "3)C": 157,
      "c2cn": 158,
      "Cc1n": 159,
      "[C@H]2CC": 160,
      "O=C(N": 161,
      "CCC1": 162,
      "[C@H](C": 163,
      "[C@@H]1": 164,
      "c2)": 165,
      "(F)C": 166,
      "2)CC1": 167,
      "S(=O)": 168,
      "c1C": 169,
      "N)": 170,
      "[C@H](C)C": 171,
      "[C@@H](C": 172,
      "=CC": 173,
      "c1cccc": 174,
      "N(C)C(=O)": 175,
      "OCC": 176,
      "(C)C)": 177,
      "c1C(=O)N": 178,
      "(N)": 179,
      "c[nH]": 180,
      "c(O)": 181,
      "[C@@H]2CC": 182,
      "[C@@H](C)C": 183,
      "(O)C": 184,
      "[C@]1": 185,
      "c1ccccc1": 186,
      "(C)CC": 187,
      "(CCC": 188,
      ")C(=O)N": 189,
      "N(C(=O)c2cc": 190,
      "NC(=O)c1cc": 191,
      "[C@H]2": 192,
      "c2C": 193,
      "[C@H](NC(=O)": 194,
      "[C@@]1": 195,
      "co": 196,
      "[C@@H](NC(=O)": 197,
      "n1cc": 198,
      "(F)(F)F)": 199,
      "n2": 200,
      "OC)": 201,
      "cc2": 202,
      "COc1cc": 203,
      "3CCC": 204,
      "c2n": 205,
      "(F)F)": 206,
      "3)CC": 207,
      "Cc1": 208,
      "c3cccc": 209,
      "S(=O)(=O)": 210,
      "C(=O)N1CC": 211,
      "[C@@H]2": 212,
      "[N": 213,
      "(C)(C)": 214,
      "+]": 215,
      "-]": 216,
      "COC": 217,
      "C#": 218,
      "2C(=O)": 219,
      "[N+]": 220,
      "[C@H](C(=O)N": 221,
      "=N": 222,
      "SC": 223,
      "2(CC": 224,
      "2(C": 225,
      "[O": 226,
      "[O-]": 227,
      "N1C(=O)": 228,
      "=O": 229,
      "n(C)": 230,
      "C[C@@H]1C": 231,
      "N1CC": 232,
      "[C@H]3": 233,
      "F)C1": 234,
      "[C@@H]3": 235,
      "s1": 236,
      "(=O)[O-]": 237,
      "[N+](=O)[O-]": 238,
      "c(Br)": 239,
      "NC": 240,
      "[C@@H]1CCC": 241,
      "cn1": 242,
      "(C(=O)N2CC": 243,
      "[C@H](CNC(=O)": 244,
      "c(-": 245,
      "CS": 246,
      "c2ccccc2": 247,
      "N(C(=O)CC": 248,
      "CC(=O)N1CC": 249,
      ")C(=O)": 250,
      "nc1": 251,
      "cccc": 252,
      "(=O)=O)": 253,
      "O=C(C": 254,
      "(N)=O)": 255,
      "1CC1": 256,
      "C[C@H]1C": 257,
      "[C@@H](O)": 258,
      "3)C1": 259,
      "2)c1": 260,
      "N2C(=O)": 261,
      "4)C": 262,
      "[C@H]1CCC": 263,
      "(CO)": 264,
      "(Br)": 265,
      "c1ncc": 266,
      "c3cn": 267,
      "/C=C": 268,
      "[C@@H](C(=O)N": 269,
      "cc1C(=O)N": 270,
      "o1": 271,
      "(CCNC(=O)": 272,
      "CCC(=O)N": 273,
      "#N)": 274,
      "[C@H](O)": 275,
      "CCN1C(=O)": 276,
      "[C@@H](CNC(=O)": 277,
      "c2)C1": 278,
      "c(F)cc": 279,
      "2CC2)": 280,
      "4)": 281,
      "c1)": 282,
      "COC(=O)": 283,
      "CC2": 284,
      "[C@](C)": 285,
      "[C@@]2": 286,
      "[C@]2": 287,
      "C=": 288,
      "nn1": 289,
      "(CNC(=O)C": 290,
      "(CC)": 291,
      "[N+](=O)[O-])": 292,
      "[C@@](C)": 293,
      "[C@H](": 294,
      "c(C(=O)N2CC": 295,
      "[C@@H]2CCC": 296,
      "c3C": 297,
      "(-": 298,
      "c2ncc": 299,
      "N(C": 300,
      "n3": 301,
      "(F)(F)C": 302,
      "c3n": 303,
      "2)CC": 304,
      "O1": 305,
      "[nH]1": 306,
      ")C2": 307,
      "N(": 308,
      "cc1C": 309,
      "CCc1cc": 310,
      "CC(C)(C)C": 311,
      "[C@H]3C": 312,
      "N(C(=O)c3cc": 313,
      "[C@H]2CCC": 314,
      "[C@H](C)C(=O)N": 315,
      "CC(C)(C)": 316,
      "=CC(=O)N": 317,
      "C[C@@H]1CC": 318,
      "ccc2": 319,
      "(C)C(=O)": 320,
      "NC(=O)C1": 321,
      "[C@@H](": 322,
      "C=CC": 323,
      "/C=C/": 324,
      "[C@@H](NC(=O)C": 325,
      "[C@H](NC(=O)C": 326,
      "Cc1cn": 327,
      "N2CC": 328,
      "(F)F": 329,
      "CC(C)C": 330,
      "[C@H]3CC": 331,
      "(C)(C)C)": 332,
      "c3ccccc3": 333,
      "CCN(C(=O)": 334,
      "S(C)": 335,
      "4CC": 336,
      "nc2": 337,
      "[C@@H]3C": 338,
      "CC1)": 339,
      "[C@@H](C)C(=O)N": 340,
      "O)C": 341,
      "NC(=O)CC": 342,
      "C[C@H]1CC": 343,
      "1)N": 344,
      "CCOCC": 345,
      "3(CC": 346,
      "NC(=O)c2cc": 347,
      "n2cc": 348,
      "c4cc": 349,
      "l)C": 350,
      "2)cc1": 351,
      "#N": 352,
      "OC1": 353,
      "cc(C(=O)N": 354,
      "(C)CCC": 355,
      "N(C(=O)c2": 356,
      "Cn1": 357,
      "3CC3)": 358,
      "1)C2": 359,
      "c(C)n": 360,
      "C[C@]1": 361,
      "(F)(F)F": 362,
      "2)C1)": 363,
      "S(C)(=O)=O)": 364,
      "c1ccc(": 365,
      "[C@H](N": 366,
      "c(Cl)cc": 367,
      "O=C(": 368,
      "[C@H](CC": 369,
      "Cc1cc(C(=O)N": 370,
      "[C@H]1C(=O)N": 371,
      "c1cs": 372,
      "CCS": 373,
      "N3": 374,
      "cs1": 375,
      "cnc1": 376,
      "N(CC": 377,
      "[C@@H]3CC": 378,
      "n2)": 379,
      "n1)": 380,
      "S(=O)(=O)N": 381,
      "[C@@H](N": 382,
      "[C@@H](O)C": 383,
      "[C@@H](CC": 384,
      "[C@H](O)C": 385,
      "c2c(": 386,
      "(C)=O)": 387,
      "N(C(=O)c2cn": 388,
      "C1CC": 389,
      "[C@H](CNC(=O)C": 390,
      "CCCCC": 391,
      "CCc1n": 392,
      "C[C@@]1": 393,
      "OC(C)(C)C": 394,
      "c(CC(=O)N": 395,
      "N(C(=O)C2": 396,
      "c1Cl": 397,
      "C[C@H]2C": 398,
      "3)C2)C1": 399,
      "CCNC(=O)": 400,
      "3(C": 401,
      "2CCCC": 402,
      "c3)": 403,
      "OCC(=O)N": 404,
      "[C@@H]1C(=O)N": 405,
      "c1ccc(C(=O)N": 406,
      "cnc2": 407,
      "2)n1": 408,
      "COCC": 409,
      "c1ccn": 410,
      "[nH]n": 411,
      "C2": 412,
      "CC1(C)C": 413,
      "c3ncc": 414,
      "Cn1cc": 415,
      "cc2C": 416,
      "c1ccc(F)": 417,
      "O=C(CC": 418,
      "c(OC)": 419,
      "cc3": 420,
      "NC(=O)c1cn": 421,
      "c(=O)": 422,
      "N1CCC": 423,
      "cc(Cl)": 424,
      "c(N)": 425,
      "cnn": 426,
      "ccc1C(=O)N": 427,
      "c1ccc(Cl)": 428,
      "c(CC": 429,
      "N1C": 430,
      "c2ccccc2)": 431,
      "C[C@@H]2C": 432,
      "(O)CC": 433,
      "(=O)N1CC": 434,
      "(C)C)C": 435,
      "CCO1": 436,
      "CC(=O)N1C": 437,
      "=N)": 438,
      "c(C(F)(F)F)": 439,
      "NC(=O)c1": 440,
      "N(C)": 441,
      "N=": 442,
      "CC(=O)N1CCC": 443,
      "(C(=O)NC": 444,
      "4C": 445,
      "4)CC": 446,
      "ccn": 447,
      "[C@@H](CNC(=O)C": 448,
      "C[C@H](NC(=O)": 449,
      "CCC2": 450,
      "(OC)": 451,
      "c2nn": 452,
      "N#": 453,
      "2)C3)": 454,
      "c(C#N)": 455,
      "3)CC2)": 456,
      "=CCC": 457,
      "(OC": 458,
      "(C)n": 459,
      "S(N)": 460,
      "c2)C": 461,
      "on": 462,
      "NC(=O)N": 463,
      "c1C(=O)N1CC": 464,
      "[C@@H]1CN(C(=O)": 465,
      "2CCN(C(=O)": 466,
      "CN(CC": 467,
      "(F)F)C": 468,
      "Cc1cccc": 469,
      "n1n": 470,
      "(C(=O)N2C": 471,
      "CCCO": 472,
      "CCc1": 473,
      "c2c1": 474,
      "c([N+](=O)[O-])": 475,
      "Cc1ccc(C(=O)N": 476,
      "CN1CC": 477,
      "(F)(F)F)C": 478,
      "CCOC(=O)": 479,
      "c2C)": 480,
      "(C#N)": 481,
      "\\\\": 482,
      "N3C(=O)": 483,
      "c2cs": 484,
      "c3)C2)": 485,
      "c(F)c1": 486,
      "CCOC": 487,
      "1CCCC1": 488,
      "(C(F)(F)F)": 489,
      ")C(C)C": 490,
      "CCN(CC": 491,
      "c(=N)": 492,
      "[C@H]1CN(C(=O)": 493,
      "c1cc2": 494,
      "ccc1C": 495,
      "C[C@@H](NC(=O)": 496,
      ")C(=O)N1CC": 497,
      "([N+](=O)[O-])": 498,
      "3)CC1": 499
    },
    "merges": [
      "C C",
      "O )",
      "( C",
      "= O)",
      "c c",
      "( =O)",
      "[ C",
      "[C @",
      "H ]",
      ") C",
      "c 1",
      "C (=O)",
      "[C@ @",
      "[C@ H]",
      "[C@@ H]",
      "(C )",
      "(C (=O)",
      "N C(=O)",
      "c 2",
      "CC C",
      "F )",
      "c1 cc",
      "(C )C",
      "1 CC",
      "N (C(=O)",
      "( F)",
      "2 )",
      "1 C",
      "(=O) N",
      "c n",
      "(C(=O) N",
      "c 3",
      "2 CC",
      "( CC",
      ")C 1",
      "2 C",
      "c2 cc",
      "= C",
      "C(=O) N",
      "CC 1",
      "c (",
      "O C",
      "NC(=O) C",
      "n 1",
      "[ n",
      "[n H]",
      "c (C",
      "l )",
      "C [C@@H]",
      "( O)",
      "C [C@H]",
      "3 )",
      "CC (=O)N",
      "( N",
      "( NC(=O)",
      "C O",
      "2 )C1",
      "1 CCC",
      "c1 n",
      "cc 1",
      "C c1cc",
      "c3 cc",
      "c (C(=O)N",
      ")C 2)",
      "[C@ ]",
      "CC CC",
      "O =C",
      "2 CCC",
      "[C@@ ]",
      "N(C(=O) C",
      "(C NC(=O)",
      "CC N",
      "CC O",
      "[C@H] 1C",
      "CC (C)",
      "cc c1",
      "[C@@H] 1C",
      "c (C)",
      "n n",
      "[C@H] 2C",
      "c(C l)",
      "3 CC",
      "1 )",
      "N (C)C",
      "c1 cn",
      "[C@@H] 2C",
      "F )C",
      "B r",
      "2 )C",
      "(F) (F)",
      "c (F)",
      "(C) (C)C",
      "c2cc cc",
      "c s",
      "[C@H] (C)",
      "[C@@H] (C)",
      "c 4",
      "3 C",
      "C 1",
      ") CC",
      "( NC(=O)C",
      "[C@H] 1",
      "n cc",
      "C N",
      "(C l)",
      "Br )",
      "C =C",
      "[C@@H] 1CC",
      "[C@H] 1CC",
      "3 )C2)",
      "(CC (=O)N",
      "1 C(=O)",
      "1 )C",
      "3 )C",
      "c2 cn",
      "C c1n",
      "[C@H] 2CC",
      "O=C (N",
      "CCC 1",
      "[C@H] (C",
      "[C@@H] 1",
      "c2 )",
      "( F)C",
      "2) CC1",
      "S (=O)",
      "c1 C",
      "N )",
      "[C@H] (C)C",
      "[C@@H] (C",
      "= CC",
      "c1cc cc",
      "N(C)C (=O)",
      "O CC",
      "(C)C )",
      "c1 C(=O)N",
      "(N )",
      "c [nH]",
      "c( O)",
      "[C@@H] 2CC",
      "[C@@H] (C)C",
      "(O) C",
      "[C@] 1",
      "c1cc ccc1",
      "(C) CC",
      "( CCC",
      ")C (=O)N",
      "N(C(=O) c2cc",
      "NC(=O) c1cc",
      "[C@H] 2",
      "c2 C",
      "[C@H] (NC(=O)",
      "[C@@] 1",
      "c o",
      "[C@@H] (NC(=O)",
      "n1 cc",
      "(F)(F) F)",
      "n 2",
      "OC )",
      "cc 2",
      "CO c1cc",
      "3 CCC",
      "c2 n",
      "(F) F)",
      "3) CC",
      "C c1",
      "c3cc cc",
      "S(=O) (=O)",
      "C(=O)N 1CC",
      "[C@@H] 2",
      "[ N",
      "(C) (C)",
      "+ ]",
      "- ]",
      "C OC",
      "C #",
      "2 C(=O)",
      "[N +]",
      "[C@H] (C(=O)N",
      "= N",
      "S C",
      "2 (CC",
      "2 (C",
      "[ O",
      "[O -]",
      "N 1C(=O)",
      "= O",
      "n (C)",
      "C[C@@H] 1C",
      "N 1CC",
      "[C@H] 3",
      "F )C1",
      "[C@@H] 3",
      "s 1",
      "(=O) [O-]",
      "[N+] (=O)[O-]",
      "c( Br)",
      "N C",
      "[C@@H] 1CCC",
      "cn 1",
      "(C(=O)N 2CC",
      "[C@H] (CNC(=O)",
      "c( -",
      "C S",
      "c2cccc c2",
      "N(C(=O) CC",
      "CC(=O)N 1CC",
      ")C (=O)",
      "n c1",
      "cc cc",
      "(=O) =O)",
      "O=C (C",
      "(N) =O)",
      "1CC 1",
      "C[C@H] 1C",
      "[C@@H] (O)",
      "3 )C1",
      "2) c1",
      "N 2C(=O)",
      "4 )C",
      "[C@H] 1CCC",
      "(C O)",
      "( Br)",
      "c1n cc",
      "c3 cn",
      "/ C=C",
      "[C@@H] (C(=O)N",
      "cc1 C(=O)N",
      "o 1",
      "(CC NC(=O)",
      "CC C(=O)N",
      "# N)",
      "[C@H] (O)",
      "CCN 1C(=O)",
      "[C@@H] (CNC(=O)",
      "c2 )C1",
      "c(F) cc",
      "2CC 2)",
      "4 )",
      "c1 )",
      "CO C(=O)",
      "CC 2",
      "[C@] (C)",
      "[C@@] 2",
      "[C@] 2",
      "C =",
      "n n1",
      "(C NC(=O)C",
      "(CC )",
      "[N+](=O)[O-] )",
      "[C@@] (C)",
      "[C@H] (",
      "c(C(=O)N 2CC",
      "[C@@H] 2CCC",
      "c3 C",
      "( -",
      "c2 ncc",
      "N (C",
      "n 3",
      "(F) (F)C",
      "c3 n",
      "2) CC",
      "O 1",
      "[nH] 1",
      ")C 2",
      "N (",
      "cc 1C",
      "CC c1cc",
      "CC(C) (C)C",
      "[C@H] 3C",
      "N(C(=O) c3cc",
      "[C@H] 2CCC",
      "[C@H](C)C (=O)N",
      "CC(C) (C)",
      "= CC(=O)N",
      "C[C@@H] 1CC",
      "cc c2",
      "(C)C (=O)",
      "NC(=O)C 1",
      "[C@@H] (",
      "C =CC",
      "/C=C /",
      "[C@@H] (NC(=O)C",
      "[C@H] (NC(=O)C",
      "C c1cn",
      "N 2CC",
      "(F) F",
      "CC (C)C",
      "[C@H] 3CC",
      "(C)(C)C )",
      "c3cccc c3",
      "CC N(C(=O)",
      "S (C)",
      "4 CC",
      "n c2",
      "[C@@H] 3C",
      "CC1 )",
      "[C@@H](C)C (=O)N",
      "O) C",
      "NC(=O) CC",
      "C[C@H] 1CC",
      "1) N",
      "CCO CC",
      "3 (CC",
      "NC(=O) c2cc",
      "n2 cc",
      "c4 cc",
      "l )C",
      "2) cc1",
      "# N",
      "OC 1",
      "cc (C(=O)N",
      "(C) CCC",
      "N(C(=O) c2",
      "C n1",
      "3CC 3)",
      "1)C 2",
      "c(C) n",
      "C [C@]1",
      "(F)(F) F",
      "2)C1 )",
      "S(C) (=O)=O)",
      "c1cc c(",
      "[C@H] (N",
      "c(Cl) cc",
      "O=C (",
      "[C@H] (CC",
      "Cc1cc (C(=O)N",
      "[C@H]1 C(=O)N",
      "c1 cs",
      "CC S",
      "N 3",
      "cs 1",
      "cn c1",
      "N (CC",
      "[C@@H] 3CC",
      "n 2)",
      "n1 )",
      "S(=O) (=O)N",
      "[C@@H] (N",
      "[C@@H] (O)C",
      "[C@@H] (CC",
      "[C@H] (O)C",
      "c2 c(",
      "(C) =O)",
      "N(C(=O) c2cn",
      "C 1CC",
      "[C@H](C NC(=O)C",
      "CC CCC",
      "CC c1n",
      "C [C@@]1",
      "OC (C)(C)C",
      "c (CC(=O)N",
      "N(C(=O)C 2",
      "c1C l",
      "C[C@H] 2C",
      "3)C 2)C1",
      "CC NC(=O)",
      "3 (C",
      "2CC CC",
      "c3 )",
      "O CC(=O)N",
      "[C@@H]1 C(=O)N",
      "c1cc c(C(=O)N",
      "cn c2",
      "2) n1",
      "CO CC",
      "c1cc n",
      "[nH] n",
      "C 2",
      "CC1 (C)C",
      "c3 ncc",
      "C n1cc",
      "cc 2C",
      "c1cc c(F)",
      "O=C (CC",
      "c( OC)",
      "cc 3",
      "NC(=O) c1cn",
      "c (=O)",
      "N 1CCC",
      "cc (Cl)",
      "c( N)",
      "cn n",
      "ccc1 C(=O)N",
      "c1cc c(Cl)",
      "c (CC",
      "N 1C",
      "c2cccc c2)",
      "C[C@@H] 2C",
      "(O) CC",
      "(=O)N 1CC",
      "(C)C )C",
      "CCO 1",
      "CC(=O)N 1C",
      "= N)",
      "c(C (F)(F)F)",
      "NC(=O) c1",
      "N (C)",
      "N =",
      "CC(=O)N 1CCC",
      "(C(=O)N C",
      "4 C",
      "4 )CC",
      "cc n",
      "[C@@H](C NC(=O)C",
      "C[C@H] (NC(=O)",
      "CCC 2",
      "( OC)",
      "c2 nn",
      "N #",
      "2)C 3)",
      "c(C #N)",
      "3)CC 2)",
      "= CCC",
      "( OC",
      "(C) n",
      "S (N)",
      "c2 )C",
      "o n",
      "NC(=O) N",
      "c1C(=O)N 1CC",
      "[C@@H]1C N(C(=O)",
      "2CC N(C(=O)",
      "CN (CC",
      "(F) F)C",
      "Cc1cc cc",
      "n1 n",
      "(C(=O)N 2C",
      "CCC O",
      "CC c1",
      "c2 c1",
      "c( [N+](=O)[O-])",
      "Cc1cc c(C(=O)N",
      "CN 1CC",
      "(F)(F) F)C",
      "CCO C(=O)",
      "c2C )",
      "(C #N)",
      "\\ \\",
      "N3 C(=O)",
      "c2 cs",
      "c3 )C2)",
      "c(F) c1",
      "CC OC",
      "1CC CC1",
      "(C (F)(F)F)",
      ")C (C)C",
      "CCN (CC",
      "c( =N)",
      "[C@H]1C N(C(=O)",
      "c1cc 2",
      "ccc1 C",
      "C[C@@H] (NC(=O)",
      ")C(=O)N 1CC",
      "( [N+](=O)[O-])",
      "3) CC1"
    ]
  }
}