{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "(": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "1": 11,
      "2": 12,
      "3": 13,
      "4": 14,
      "5": 15,
      "6": 16,
      "7": 17,
      "8": 18,
      "9": 19,
      "=": 20,
      "@": 21,
      "B": 22,
      "C": 23,
      "F": 24,
      "H": 25,
      "I": 26,
      "N": 27,
      "O": 28,
      "P": 29,
      "S": 30,
      "[": 31,
      "]": 32,
      "c": 33,
      "e": 34,
      "i": 35,
      "l": 36,
      "n": 37,
      "o": 38,
      "r": 39,
      "s": 40,
      "CC": 41,
      "O)": 42,
      "(C": 43,
      "=O)": 44,
      "(=O)": 45,
      "[C": 46,
      "[C@": 47,
      "H]": 48,
      "cc": 49,
      ")C": 50,
      "[C@H]": 51,
      "[C@@": 52,
      "c1": 53,
      "C(=O)": 54,
      "[C@@H]": 55,
      "(C)": 56,
      "(=O)N": 57,
      "NC(=O)": 58,
      "CCC": 59,
      "c2": 60,
      "N(C": 61,
      "F)": 62,
      "1CC": 63,
      "c1cc": 64,
      "2)": 65,
      "1C": 66,
      "(C)C": 67,
      "N(C(=O)": 68,
      "(F)": 69,
      "(C(=O)N": 70,
      "cn": 71,
      "2CC": 72,
      "(CC": 73,
      ")C1": 74,
      "2C": 75,
      "c3": 76,
      "CC1": 77,
      "OC": 78,
      "C(=O)N": 79,
      "=C": 80,
      "c2cc": 81,
      "c(": 82,
      "NC(=O)C": 83,
      "n1": 84,
      "[C@H](": 85,
      "[n": 86,
      "[nH]": 87,
      "[C@@H](": 88,
      "2)C1": 89,
      "CC(=O)N": 90,
      "3)": 91,
      "CO": 92,
      "1CCC": 93,
      "c(C": 94,
      "C[C@H]": 95,
      "c1n": 96,
      "C[C@@H]": 97,
      "l)": 98,
      "[C@]": 99,
      "N(C)C": 100,
      "CCCC": 101,
      "[C@@]": 102,
      "(N": 103,
      "Cc1cc": 104,
      "2CCC": 105,
      "cc1": 106,
      "nn": 107,
      "[C@H]1C": 108,
      ")C2)": 109,
      "CC(C)": 110,
      "CCO": 111,
      "O=C": 112,
      "N(C(=O)C": 113,
      "O)C": 114,
      "c3cc": 115,
      "c(C(=O)N": 116,
      "(CNC(=O)": 117,
      "[C@@H]1C": 118,
      "CCN": 119,
      "1)": 120,
      "[C@H]2C": 121,
      "c(C)": 122,
      "ccc1": 123,
      "c1cn": 124,
      "3CC": 125,
      "F)C": 126,
      "[C@H](C)": 127,
      "(C)(C)C": 128,
      "2)C": 129,
      "[C@@H]2C": 130,
      "[C@@H](C)": 131,
      "Br": 132,
      "(F)(F)": 133,
      "[C@H]1": 134,
      "3C": 135,
      "cs": 136,
      "c(Cl)": 137,
      "1)C": 138,
      "N(C)C(=O)": 139,
      "[C@H]1CC": 140,
      "(O)": 141,
      "c(F)": 142,
      "(CC(=O)N": 143,
      ")CC": 144,
      "[C@@H]1CC": 145,
      "c2cccc": 146,
      "1C(=O)": 147,
      "[C@H](C": 148,
      "C=C": 149,
      "=CC": 150,
      "CCC1": 151,
      "C1": 152,
      "ncc": 153,
      "[C@@H]1": 154,
      "[C@@H](C": 155,
      "[C@H]2CC": 156,
      "Br)": 157,
      "(NC(=O)": 158,
      "OCC": 159,
      "CN": 160,
      "[C@H](C)C": 161,
      "3)C": 162,
      "3)C2)": 163,
      "c4": 164,
      "c2cn": 165,
      "Cc1n": 166,
      "(C)CC": 167,
      "2)CC1": 168,
      "S(=O)": 169,
      ")C(=O)N": 170,
      "(Cl)": 171,
      "=N": 172,
      "[C@H](NC(=O)": 173,
      "[C@]1": 174,
      "c1C": 175,
      "[C@@H](C)C": 176,
      "O=C(N": 177,
      "(C)C)": 178,
      "[C@H](C(=O)N": 179,
      "[C@@H](NC(=O)": 180,
      "(N)": 181,
      "c2)": 182,
      "C#": 183,
      "[C@@H]2CC": 184,
      "C(=O)N1CC": 185,
      "c[nH]": 186,
      "[C@H]2": 187,
      "[C@@]1": 188,
      "c1cccc": 189,
      "n1cc": 190,
      "c(O)": 191,
      "OC)": 192,
      "#N": 193,
      "co": 194,
      "nc1": 195,
      "[C@@H](C(=O)N": 196,
      "3CCC": 197,
      "NC": 198,
      "n2": 199,
      "(C)(C)": 200,
      "SC": 201,
      "c1ccccc1": 202,
      "[C@@H]2": 203,
      "c2C": 204,
      "(CCC": 205,
      "c2n": 206,
      "[N": 207,
      "N1C(=O)": 208,
      "(F)F)": 209,
      "COC": 210,
      "NC(=O)c1cc": 211,
      "N(C(=O)c2cc": 212,
      "3)CC": 213,
      "N1CC": 214,
      "S(=O)(=O)": 215,
      "Cc1": 216,
      "(F)(F)F)": 217,
      "2C(=O)": 218,
      "2(CC": 219,
      "(F)C": 220,
      "2(C": 221,
      "=O": 222,
      "cc2": 223,
      "+]": 224,
      "COc1cc": 225,
      "-]": 226,
      "[C@H](O)": 227,
      "F)C1": 228,
      "n(C)": 229,
      "1CC1": 230,
      "[C@@H]1CCC": 231,
      "[N+]": 232,
      "c(N": 233,
      "cn1": 234,
      "c3cccc": 235,
      "[C@H]3": 236,
      "C[C@@H]1C": 237,
      ")C(=O)": 238,
      "(N)=O)": 239,
      "[C@H]1CCC": 240,
      "c1C(=O)N": 241,
      "(C(=O)N2CC": 242,
      "CC(=O)N1CC": 243,
      "CS": 244,
      "c(Br)": 245,
      "[C@@H]3": 246,
      "s1": 247,
      "C[C@H]1C": 248,
      "2CC2)": 249,
      "[C@H](CC": 250,
      "c1ncc": 251,
      "nn1": 252,
      "[C@@H](O)": 253,
      "N(C(=O)CC": 254,
      "[C@H](CNC(=O)": 255,
      "[O": 256,
      "[O-]": 257,
      "N2C(=O)": 258,
      "COC(=O)": 259,
      "[C@](C)": 260,
      "C=": 261,
      "[C@H](O)C": 262,
      "c2)C1": 263,
      "o1": 264,
      "3)C1": 265,
      "NC(=O)C1": 266,
      "CCN1C(=O)": 267,
      "O=C(C": 268,
      "#N)": 269,
      "[C@@](C)": 270,
      "[C@@H](O)C": 271,
      "(CO)": 272,
      "[C@@H](CC": 273,
      "(=O)[O-]": 274,
      "[N+](=O)[O-]": 275,
      "c1)": 276,
      "CCC(=O)N": 277,
      "4)C": 278,
      "[C@]2": 279,
      "(Br)": 280,
      "CC2": 281,
      "(=O)=O)": 282,
      "[nH]1": 283,
      "cc1C": 284,
      "O1": 285,
      "[C@@]2": 286,
      "C=CC": 287,
      "N(": 288,
      "c(-": 289,
      "c3cn": 290,
      "[C@H]3C": 291,
      "CC(C)(C)C": 292,
      "(NC(=O)C": 293,
      "[C@H](NC(=O)C": 294,
      "cc1C(=O)N": 295,
      "2)CC": 296,
      "/C=C": 297,
      "2)c1": 298,
      "(CC)": 299,
      "/C=C/": 300,
      "[C@@H]2CCC": 301,
      "[C@H](C)C(=O)N": 302,
      "c(=N": 303,
      "[C@@H](CNC(=O)": 304,
      "NC(=O)CC": 305,
      "(C(=O)NC": 306,
      "[C@@H](NC(=O)C": 307,
      "[C@H]2CCC": 308,
      "4)": 309,
      "CC(C)(C)": 310,
      "c2ncc": 311,
      "c2ccccc2": 312,
      "(CNC(=O)C": 313,
      "N=": 314,
      "(F)(F)C": 315,
      "N(CC": 316,
      "CC(C)C": 317,
      "OC1": 318,
      "cccc": 319,
      "n3": 320,
      "CCOCC": 321,
      "(-": 322,
      "(F)F": 323,
      ")C2": 324,
      "c3C": 325,
      "C[C@@H]1CC": 326,
      "c(C(=O)N2CC": 327,
      "CC1)": 328,
      "Cc1cn": 329,
      "CCc1cc": 330,
      "[C@H]3CC": 331,
      "c(F)cc": 332,
      "c3n": 333,
      "[C@@H](C)C(=O)N": 334,
      "C[C@H]1CC": 335,
      "[N+](=O)[O-])": 336,
      "n2cc": 337,
      "(C)(C)C)": 338,
      "CCN(C(=O)": 339,
      "[C@@H]3C": 340,
      "(C)CCC": 341,
      "C(=O)NC": 342,
      "ccc2": 343,
      "nc2": 344,
      "=CC(=O)N": 345,
      "3(CC": 346,
      "4CC": 347,
      "1)N": 348,
      "S(=O)(=O)N": 349,
      "N2CC": 350,
      "(O)C": 351,
      "cnc1": 352,
      "S(C)": 353,
      "1)C2": 354,
      "CCNC(=O)": 355,
      "l)C": 356,
      "Cn1": 357,
      "N(C(=O)c3cc": 358,
      "[C@H]1C(=O)N": 359,
      "n2)": 360,
      "NC(=O)c2cc": 361,
      "c3ccccc3": 362,
      "3CC3)": 363,
      "c2nn": 364,
      "2)C1)": 365,
      "[C@@H]1C(=O)N": 366,
      "(F)(F)F": 367,
      "COCC": 368,
      "CC2)": 369,
      "CCCCC": 370,
      "c1cs": 371,
      "C[C@]1": 372,
      "3)C2)C1": 373,
      "n1)": 374,
      "(C)=O)": 375,
      "O=C(": 376,
      "CCN(CC": 377,
      "CCS": 378,
      "cs1": 379,
      "F)C(=O)N": 380,
      "c(C)n": 381,
      "N(C)": 382,
      "[C@@H]3CC": 383,
      "S(C)(=O)=O)": 384,
      "N(C)C)": 385,
      "CC1(C)C": 386,
      "OCC(=O)N": 387,
      "N(C(=O)C2": 388,
      "OC(C)(C)C": 389,
      "CCc1n": 390,
      "c4cc": 391,
      "(C(=O)N2C": 392,
      "N(C(=O)c2": 393,
      "N1CCC": 394,
      "C[C@H]2C": 395,
      "c1ccc(": 396,
      "C1CC": 397,
      "3(C": 398,
      "n1C": 399,
      "c1ccn": 400,
      "CCO1": 401,
      "N1C": 402,
      "Cc1cccc": 403,
      "CCOC": 404,
      "c(Cl)cc": 405,
      "=CCC": 406,
      "c2c(": 407,
      "2)cc1": 408,
      "[C@H](CNC(=O)C": 409,
      "N3": 410,
      "N(C(=O)c2cn": 411,
      "cnc2": 412,
      "1)C(=O)N": 413,
      "c(C(=O)NC": 414,
      "NC(=O)c1cn": 415,
      "Cn1cc": 416,
      "[C@H](CC(=O)N": 417,
      "c1[nH]": 418,
      "OC)C": 419,
      "C[C@@]1": 420,
      "n2)C1": 421,
      "cc2C": 422,
      "O)C1": 423,
      "2)n1": 424,
      "(C)C)C": 425,
      "(C(=O)N2CCC": 426,
      "O=C(CC": 427,
      "C#CC": 428,
      "1)C(=O)": 429,
      "OC)C(=O)N": 430,
      "CN(CC": 431,
      "1CCCC1": 432,
      "c1ccc(F)": 433,
      "c(CC(=O)N": 434,
      "CC(=O)N1C": 435,
      "c3)": 436,
      "4C": 437,
      "c1ccc(C": 438,
      "CCC2": 439,
      "c3ncc": 440,
      "CCOC(=O)": 441,
      "c(N)": 442,
      "CC(=O)": 443,
      "c(=O)": 444,
      "CN1CC": 445,
      "Cc1ncc": 446,
      "c1Cl": 447,
      "CCn1": 448,
      "CC[C@H](C)": 449,
      "C[C@@H]2C": 450,
      "c(CC": 451,
      "c(OC)": 452,
      "(OC)": 453,
      "NC(=O)c1": 454,
      "CC(=O)N1CCC": 455,
      "NC(=O)N": 456,
      "C(=O)N1C": 457,
      "CN(C": 458,
      "C[C@H](C": 459,
      ")CC1": 460,
      "c2ccccc2)": 461,
      "N#": 462,
      "(C)(C)C(=O)N": 463,
      "2CCCC": 464,
      "3)CC1": 465,
      "ncn": 466,
      "3)CC2)": 467,
      "(C#N)": 468,
      "C[C@@H](C": 469,
      "c(=N)": 470,
      "(C)C)C1": 471,
      "(F)cc": 472,
      "[C@@H](CNC(=O)C": 473,
      "[C@H]1CN(C(=O)": 474,
      "c1ccc(Cl)": 475,
      "C[C@H]1": 476,
      "[C@@H]1CN(C(=O)": 477,
      "(F)(": 478,
      "CC1CC": 479,
      "Cc1cc(C(=O)N": 480,
      "C[C@@H]1": 481,
      "c(C)c1": 482,
      "C(=O)N1CCC": 483,
      "c(C(=O)N2C": 484,
      "CCCO": 485,
      "4)CC": 486,
      "(=N": 487,
      "2CC2)C1": 488,
      "(CCNC(=O)": 489,
      "n[nH]": 490,
      "cc3": 491,
      "(O)CC": 492,
      "2(CCC": 493,
      "[S": 494,
      "S(N)": 495,
      "ccc1C": 496,
      "N(C)C(=O)C": 497,
      "F)C2)": 498,
      "(F)F)C": 499
    },
    "merges": [
      "C C",
      "O )",
      "( C",
      "= O)",
      "( =O)",
      "[ C",
      "[C @",
      "H ]",
      "c c",
      ") C",
      "[C@ H]",
      "[C@ @",
      "c 1",
      "C (=O)",
      "[C@@ H]",
      "(C )",
      "(=O) N",
      "N C(=O)",
      "CC C",
      "c 2",
      "N (C",
      "F )",
      "1 CC",
      "c1 cc",
      "2 )",
      "1 C",
      "(C )C",
      "N(C (=O)",
      "( F)",
      "(C (=O)N",
      "c n",
      "2 CC",
      "( CC",
      ")C 1",
      "2 C",
      "c 3",
      "CC 1",
      "O C",
      "C(=O) N",
      "= C",
      "c2 cc",
      "c (",
      "NC(=O) C",
      "n 1",
      "[C@H] (",
      "[ n",
      "[n H]",
      "[C@@H] (",
      "2 )C1",
      "CC (=O)N",
      "3 )",
      "C O",
      "1 CCC",
      "c (C",
      "C [C@H]",
      "c1 n",
      "C [C@@H]",
      "l )",
      "[C@ ]",
      "N(C )C",
      "CC CC",
      "[C@@ ]",
      "( N",
      "C c1cc",
      "2 CCC",
      "cc 1",
      "n n",
      "[C@H] 1C",
      ")C 2)",
      "CC (C)",
      "CC O",
      "O =C",
      "N(C(=O) C",
      "O) C",
      "c3 cc",
      "c (C(=O)N",
      "(C NC(=O)",
      "[C@@H] 1C",
      "CC N",
      "1 )",
      "[C@H] 2C",
      "c (C)",
      "cc c1",
      "c1 cn",
      "3 CC",
      "F )C",
      "[C@H] (C)",
      "(C) (C)C",
      "2 )C",
      "[C@@H] 2C",
      "[C@@H] (C)",
      "B r",
      "(F) (F)",
      "[C@H] 1",
      "3 C",
      "c s",
      "c(C l)",
      "1 )C",
      "N(C)C (=O)",
      "[C@H] 1CC",
      "( O)",
      "c (F)",
      "(CC (=O)N",
      ") CC",
      "[C@@H] 1CC",
      "c2cc cc",
      "1 C(=O)",
      "[C@H] (C",
      "C =C",
      "= CC",
      "CCC 1",
      "C 1",
      "n cc",
      "[C@@H] 1",
      "[C@@H] (C",
      "[C@H] 2CC",
      "Br )",
      "( NC(=O)",
      "O CC",
      "C N",
      "[C@H] (C)C",
      "3 )C",
      "3 )C2)",
      "c 4",
      "c2 cn",
      "C c1n",
      "(C) CC",
      "2) CC1",
      "S (=O)",
      ")C (=O)N",
      "(C l)",
      "= N",
      "[C@H]( NC(=O)",
      "[C@] 1",
      "c1 C",
      "[C@@H] (C)C",
      "O=C (N",
      "(C)C )",
      "[C@H] (C(=O)N",
      "[C@@H]( NC(=O)",
      "(N )",
      "c2 )",
      "C #",
      "[C@@H] 2CC",
      "C(=O)N 1CC",
      "c [nH]",
      "[C@H] 2",
      "[C@@] 1",
      "c1cc cc",
      "n1 cc",
      "c( O)",
      "OC )",
      "# N",
      "c o",
      "n c1",
      "[C@@H] (C(=O)N",
      "3 CCC",
      "N C",
      "n 2",
      "(C) (C)",
      "S C",
      "c1cc ccc1",
      "[C@@H] 2",
      "c2 C",
      "( CCC",
      "c2 n",
      "[ N",
      "N 1C(=O)",
      "(F) F)",
      "C OC",
      "NC(=O) c1cc",
      "N(C(=O) c2cc",
      "3) CC",
      "N 1CC",
      "S(=O) (=O)",
      "C c1",
      "(F)(F) F)",
      "2 C(=O)",
      "2 (CC",
      "( F)C",
      "2 (C",
      "= O",
      "cc 2",
      "+ ]",
      "CO c1cc",
      "- ]",
      "[C@H]( O)",
      "F )C1",
      "n (C)",
      "1CC 1",
      "[C@@H] 1CCC",
      "[N +]",
      "c( N",
      "cn 1",
      "c3cc cc",
      "[C@H] 3",
      "C[C@@H] 1C",
      ")C (=O)",
      "(N) =O)",
      "[C@H] 1CCC",
      "c1 C(=O)N",
      "(C(=O)N 2CC",
      "CC(=O)N 1CC",
      "C S",
      "c( Br)",
      "[C@@H] 3",
      "s 1",
      "C[C@H] 1C",
      "2CC 2)",
      "[C@H] (CC",
      "c1n cc",
      "n n1",
      "[C@@H]( O)",
      "N(C(=O) CC",
      "[C@H] (CNC(=O)",
      "[ O",
      "[O -]",
      "N 2C(=O)",
      "CO C(=O)",
      "[C@] (C)",
      "C =",
      "[C@H]( O)C",
      "c2 )C1",
      "o 1",
      "3 )C1",
      "NC(=O)C 1",
      "CCN 1C(=O)",
      "O=C (C",
      "#N )",
      "[C@@] (C)",
      "[C@@H]( O)C",
      "(C O)",
      "[C@@H] (CC",
      "(=O) [O-]",
      "[N+] (=O)[O-]",
      "c1 )",
      "CC C(=O)N",
      "4 )C",
      "[C@] 2",
      "( Br)",
      "CC 2",
      "(=O) =O)",
      "[nH] 1",
      "cc 1C",
      "O 1",
      "[C@@] 2",
      "C =CC",
      "N (",
      "c( -",
      "c3 cn",
      "[C@H] 3C",
      "CC(C) (C)C",
      "( NC(=O)C",
      "[C@H]( NC(=O)C",
      "cc1 C(=O)N",
      "2) CC",
      "/ C=C",
      "2) c1",
      "(CC )",
      "/C=C /",
      "[C@@H] 2CCC",
      "[C@H](C)C (=O)N",
      "c( =N",
      "[C@@H] (CNC(=O)",
      "NC(=O) CC",
      "(C(=O)N C",
      "[C@@H]( NC(=O)C",
      "[C@H] 2CCC",
      "4 )",
      "CC(C) (C)",
      "c2 ncc",
      "c2cccc c2",
      "(C NC(=O)C",
      "N =",
      "(F) (F)C",
      "N (CC",
      "CC (C)C",
      "OC 1",
      "cc cc",
      "n 3",
      "CCO CC",
      "( -",
      "(F) F",
      ")C 2",
      "c3 C",
      "C[C@@H] 1CC",
      "c(C(=O)N 2CC",
      "CC1 )",
      "C c1cn",
      "CC c1cc",
      "[C@H] 3CC",
      "c(F) cc",
      "c3 n",
      "[C@@H](C)C (=O)N",
      "C[C@H] 1CC",
      "[N+](=O)[O-] )",
      "n2 cc",
      "(C)(C)C )",
      "CC N(C(=O)",
      "[C@@H] 3C",
      "(C) CCC",
      "C(=O)N C",
      "cc c2",
      "n c2",
      "= CC(=O)N",
      "3 (CC",
      "4 CC",
      "1) N",
      "S(=O) (=O)N",
      "N 2CC",
      "( O)C",
      "cn c1",
      "S (C)",
      "1)C 2",
      "CC NC(=O)",
      "l )C",
      "C n1",
      "N(C(=O) c3cc",
      "[C@H]1 C(=O)N",
      "n 2)",
      "NC(=O) c2cc",
      "c3cccc c3",
      "3CC 3)",
      "c2 nn",
      "2)C1 )",
      "[C@@H]1 C(=O)N",
      "(F)(F) F",
      "CO CC",
      "CC 2)",
      "CC CCC",
      "c1 cs",
      "C [C@]1",
      "3)C 2)C1",
      "n1 )",
      "(C) =O)",
      "O=C (",
      "CCN (CC",
      "CC S",
      "cs 1",
      "F)C (=O)N",
      "c(C) n",
      "N (C)",
      "[C@@H] 3CC",
      "S(C) (=O)=O)",
      "N(C)C )",
      "CC1 (C)C",
      "O CC(=O)N",
      "N(C(=O)C 2",
      "OC (C)(C)C",
      "CC c1n",
      "c4 cc",
      "(C(=O)N 2C",
      "N(C(=O) c2",
      "N 1CCC",
      "C[C@H] 2C",
      "c1cc c(",
      "C 1CC",
      "3 (C",
      "n 1C",
      "c1cc n",
      "CCO 1",
      "N 1C",
      "Cc1cc cc",
      "CC OC",
      "c(Cl) cc",
      "= CCC",
      "c2 c(",
      "2) cc1",
      "[C@H](C NC(=O)C",
      "N 3",
      "N(C(=O) c2cn",
      "cn c2",
      "1)C (=O)N",
      "c(C(=O)N C",
      "NC(=O) c1cn",
      "C n1cc",
      "[C@H] (CC(=O)N",
      "c1 [nH]",
      "OC )C",
      "C [C@@]1",
      "n 2)C1",
      "cc 2C",
      "O)C 1",
      "2) n1",
      "(C)C )C",
      "(C(=O)N 2CCC",
      "O=C (CC",
      "C# CC",
      "1)C (=O)",
      "OC )C(=O)N",
      "CN (CC",
      "1CC CC1",
      "c1cc c(F)",
      "c (CC(=O)N",
      "CC(=O)N 1C",
      "c3 )",
      "4 C",
      "c1cc c(C",
      "CCC 2",
      "c3 ncc",
      "CCO C(=O)",
      "c(N )",
      "CC (=O)",
      "c (=O)",
      "CN 1CC",
      "Cc1n cc",
      "c1C l",
      "CC n1",
      "CC [C@H](C)",
      "C[C@@H] 2C",
      "c (CC",
      "c( OC)",
      "( OC)",
      "NC(=O) c1",
      "CC(=O)N 1CCC",
      "NC(=O) N",
      "C(=O)N 1C",
      "C N(C",
      "C[C@H] (C",
      ") CC1",
      "c2cccc c2)",
      "N #",
      "(C)(C)C (=O)N",
      "2CC CC",
      "3) CC1",
      "n cn",
      "3)CC 2)",
      "(C #N)",
      "C[C@@H] (C",
      "c(=N )",
      "(C)C )C1",
      "(F) cc",
      "[C@@H](C NC(=O)C",
      "[C@H]1C N(C(=O)",
      "c1cc c(Cl)",
      "C[C@H] 1",
      "[C@@H]1C N(C(=O)",
      "(F) (",
      "CC 1CC",
      "Cc1cc (C(=O)N",
      "C[C@@H] 1",
      "c(C) c1",
      "C(=O)N 1CCC",
      "c(C(=O)N 2C",
      "CCC O",
      "4 )CC",
      "( =N",
      "2CC 2)C1",
      "(CC NC(=O)",
      "n [nH]",
      "cc 3",
      "(O) CC",
      "2 (CCC",
      "[ S",
      "S (N)",
      "ccc1 C",
      "N(C)C(=O) C",
      "F )C2)",
      "(F) F)C"
    ]
  }
}