{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "%": 5,
      "(": 6,
      ")": 7,
      "+": 8,
      "-": 9,
      ".": 10,
      "/": 11,
      "0": 12,
      "1": 13,
      "2": 14,
      "3": 15,
      "4": 16,
      "5": 17,
      "6": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "=": 22,
      "@": 23,
      "B": 24,
      "C": 25,
      "F": 26,
      "H": 27,
      "I": 28,
      "N": 29,
      "O": 30,
      "P": 31,
      "S": 32,
      "[": 33,
      "]": 34,
      "c": 35,
      "e": 36,
      "i": 37,
      "l": 38,
      "n": 39,
      "o": 40,
      "r": 41,
      "s": 42,
      "@@": 43,
      "C@@": 44,
      "[C@@": 45,
      "[C@@H": 46,
      "[C@@H]": 47,
      "Cl": 48,
      "[n": 49,
      "[nH": 50,
      "[nH]": 51,
      "@]": 52,
      "C@]": 53,
      "[C@]": 54,
      "[C@@]": 55,
      "Br": 56,
      "[N": 57,
      "+]": 58,
      "-]": 59,
      "[N+]": 60,
      "[O": 61,
      "[O-]": 62,
      "[S": 63,
      "[N-]": 64,
      "[S@]": 65,
      "@@]": 66,
      "[S@@]": 67,
      "[n+]": 68,
      "[Si": 69,
      "[Si]": 70,
      "[S+]": 71,
      "[P": 72,
      "[P@]": 73,
      "[P@@]": 74,
      "[N@]": 75,
      "[N@@]": 76,
      "H+]": 77,
      "B-]": 78,
      "[B-]": 79,
      "[NH+]": 80,
      "[NH": 81,
      "[N@@": 82,
      "[N@@H+]": 83,
      "2+]": 84,
      "[NH2+]": 85,
      "[N@": 86,
      "[N@H+]": 87,
      "[O]": 88,
      "3+]": 89,
      "[NH3+]": 90,
      "[PH": 91,
      "[PH]": 92,
      "[Si@]": 93,
      "[Si@@]": 94,
      "[n-]": 95,
      "[N@+]": 96,
      "[nH+]": 97,
      "[N@@+]": 98,
      "n]": 99,
      "[Sn]": 100,
      "[s": 101,
      "[s+]": 102,
      "e]": 103,
      "[Se]": 104,
      "[Cl": 105,
      "[Cl-]": 106,
      "[N]": 107,
      "C]": 108,
      "C-]": 109,
      "[C]": 110,
      "[C-]": 111,
      "%1": 112,
      "@@+]": 113,
      "[S@@+]": 114,
      "@@H": 115,
      "[O+]": 116,
      "[SH": 117,
      "[Si@": 118,
      "%10": 119,
      "%11": 120,
      "@@H]": 121,
      "[SH]": 122,
      "[Si@H": 123,
      "[Si@H]": 124,
      "[c": 125,
      "[o": 126,
      "[Si@@H]": 127,
      "[P+]": 128,
      "[P@@H]": 129,
      "[NH]": 130,
      "[c-]": 131,
      "[o+]": 132
    },
    "merges": [
      "@ @",
      "C @@",
      "[ C@@",
      "[C@@ H",
      "[C@@H ]",
      "C l",
      "[ n",
      "[n H",
      "[nH ]",
      "@ ]",
      "C @]",
      "[ C@]",
      "[C@@ ]",
      "B r",
      "[ N",
      "+ ]",
      "- ]",
      "[N +]",
      "[ O",
      "[O -]",
      "[ S",
      "[N -]",
      "[S @]",
      "@@ ]",
      "[S @@]",
      "[n +]",
      "[S i",
      "[Si ]",
      "[S +]",
      "[ P",
      "[P @]",
      "[P @@]",
      "[N @]",
      "[N @@]",
      "H +]",
      "B -]",
      "[ B-]",
      "[N H+]",
      "[N H",
      "[N @@",
      "[N@@ H+]",
      "2 +]",
      "[NH 2+]",
      "[N @",
      "[N@ H+]",
      "[O ]",
      "3 +]",
      "[NH 3+]",
      "[P H",
      "[PH ]",
      "[Si @]",
      "[Si @@]",
      "[n -]",
      "[N@ +]",
      "[nH +]",
      "[N@@ +]",
      "n ]",
      "[S n]",
      "[ s",
      "[s +]",
      "e ]",
      "[S e]",
      "[ Cl",
      "[Cl -]",
      "[N ]",
      "C ]",
      "C -]",
      "[ C]",
      "[ C-]",
      "% 1",
      "@@ +]",
      "[S @@+]",
      "@@ H",
      "[O +]",
      "[S H",
      "[Si @",
      "%1 0",
      "%1 1",
      "@@H ]",
      "[SH ]",
      "[Si@ H",
      "[Si@H ]",
      "[ c",
      "[ o",
      "[Si @@H]",
      "[P +]",
      "[P @@H]",
      "[NH ]",
      "[c -]",
      "[o +]"
    ]
  }
}