{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "+": 5,
      "-": 6,
      ".": 7,
      "/": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "=": 13,
      "@": 14,
      "B": 15,
      "C": 16,
      "F": 17,
      "H": 18,
      "I": 19,
      "N": 20,
      "O": 21,
      "P": 22,
      "R": 23,
      "S": 24,
      "[": 25,
      "]": 26,
      "a": 27,
      "c": 28,
      "e": 29,
      "g": 30,
      "h": 31,
      "i": 32,
      "l": 33,
      "n": 34,
      "r": 35,
      "C]": 36,
      "[C]": 37,
      "[O": 38,
      "[O]": 39,
      "g1": 40,
      "ng1": 41,
      "ing1": 42,
      "Ring1": 43,
      "Ring1]": 44,
      "g2": 45,
      "ng2": 46,
      "ing2": 47,
      "Ring2": 48,
      "Ring2]": 49,
      "[Ring2]": 50,
      "[Ring1]": 51,
      "@@": 52,
      "[#": 53,
      "C@@": 54,
      "[C@@": 55,
      "[C@@H": 56,
      "[C@@H1": 57,
      "[C@@H1]": 58,
      "N]": 59,
      "1]": 60,
      "H1]": 61,
      "@H1]": 62,
      "C@H1]": 63,
      "[C@H1]": 64,
      "=N]": 65,
      "[=N]": 66,
      "[#B": 67,
      "[#Br": 68,
      "[#Bra": 69,
      "[#Bran": 70,
      "[#Branc": 71,
      "[#Branch": 72,
      "[S": 73,
      "[S]": 74,
      "F]": 75,
      "[F]": 76,
      "[#Branch1]": 77,
      "O]": 78,
      "[#C]": 79,
      "[C": 80,
      "[P": 81,
      "[P]": 82,
      "[#Branch2": 83,
      "[#Branch2]": 84,
      "=Ring1]": 85,
      "[=Ring1]": 86,
      "[N": 87,
      "l]": 88,
      "[Cl]": 89,
      "[NH1]": 90,
      "h1]": 91,
      "ch1]": 92,
      "nch1]": 93,
      "anch1]": 94,
      "ranch1]": 95,
      "Branch1]": 96,
      "[Branch1]": 97,
      "@]": 98,
      "[C@]": 99,
      "[C@@]": 100,
      "[N]": 101,
      "=B": 102,
      "[=B": 103,
      "[=Br": 104,
      "[=Bra": 105,
      "[=Bran": 106,
      "[=Branc": 107,
      "[=Branch": 108,
      "[=Branch2": 109,
      "[=Branch2]": 110,
      "r]": 111,
      "Br]": 112,
      "[Br]": 113,
      "[/": 114,
      "[/C]": 115,
      "[#N]": 116,
      "=Ring2]": 117,
      "[=Ring2]": 118,
      "+1]": 119,
      "-1]": 120,
      "[O-1]": 121,
      "[N+1]": 122,
      "=N": 123,
      "[=N": 124,
      "[=N+1]": 125,
      "I]": 126,
      "[I]": 127,
      "[=N-1]": 128,
      "=S": 129,
      "[=S": 130,
      "[S@]": 131,
      "@@]": 132,
      "[=S]": 133,
      "[S@@]": 134,
      "[N-1]": 135,
      "[Si": 136,
      "[Si]": 137,
      "[/C@H1]": 138,
      "[/C": 139,
      "[/Cl]": 140,
      "[/C@@": 141,
      "[/C@@H1]": 142,
      "[S+1]": 143,
      "[=S@]": 144,
      "[=S@@]": 145,
      "B]": 146,
      "[B]": 147,
      "[/Br]": 148,
      "[/S": 149,
      "[/S]": 150,
      "[P@]": 151,
      "[/F]": 152,
      "[P@@]": 153,
      "[N@]": 154,
      "[/N]": 155,
      "[/O]": 156,
      "N+1]": 157,
      "[/N+1]": 158,
      "[N@@]": 159,
      "1+1]": 160,
      "H1+1]": 161,
      "P]": 162,
      "=P]": 163,
      "[=P]": 164,
      "[/I]": 165,
      "B-1]": 166,
      "[B-1]": 167,
      "[NH1+1]": 168,
      "[NH": 169,
      "[N@@": 170,
      "[N@@H1+1]": 171,
      "2+1]": 172,
      "[NH2+1]": 173,
      "[N@": 174,
      "[N@H1+1]": 175,
      "0]": 176,
      "H0]": 177,
      "[OH0]": 178,
      "3+1]": 179,
      "[NH3+1]": 180,
      "[PH1]": 181,
      "[Si@]": 182,
      "[Si@@]": 183,
      "[/S@@]": 184,
      "[=NH1+1]": 185,
      "[N@+1]": 186,
      "[/S@]": 187,
      "[N@@+1]": 188,
      "n]": 189,
      "[Sn]": 190,
      "[/P]": 191,
      "e]": 192,
      "[=Se]": 193,
      "l-1]": 194,
      "[Cl-1]": 195,
      "[#N+1]": 196,
      "H2+1]": 197,
      "[=NH2+1]": 198,
      "[/C@]": 199,
      "=P": 200,
      "[=P": 201,
      "[C-1]": 202,
      "[CH0]": 203,
      "[=S+1]": 204,
      "[NH0]": 205,
      "@@+1]": 206,
      "[S@@+1]": 207,
      "[=P@@]": 208,
      "[=NH0]": 209,
      "[=P@]": 210,
      "O+1]": 211,
      "=O+1]": 212,
      "O-1]": 213,
      "[=O+1]": 214,
      "@@H1]": 215,
      "[/O-1]": 216,
      "[Si@H1]": 217,
      "[/C@@]": 218,
      "i]": 219,
      "[O+1]": 220,
      "[SH1]": 221,
      "[P+1]": 222,
      "[P@@H1]": 223,
      "[=SH1]": 224,
      "[Si@@H1]": 225,
      "[/Si]": 226
    },
    "merges": [
      "C ]",
      "[ C]",
      "[ O",
      "[O ]",
      "g 1",
      "n g1",
      "i ng1",
      "R ing1",
      "Ring1 ]",
      "g 2",
      "n g2",
      "i ng2",
      "R ing2",
      "Ring2 ]",
      "[ Ring2]",
      "[ Ring1]",
      "@ @",
      "[ #",
      "C @@",
      "[ C@@",
      "[C@@ H",
      "[C@@H 1",
      "[C@@H1 ]",
      "N ]",
      "1 ]",
      "H 1]",
      "@ H1]",
      "C @H1]",
      "[ C@H1]",
      "= N]",
      "[ =N]",
      "[# B",
      "[#B r",
      "[#Br a",
      "[#Bra n",
      "[#Bran c",
      "[#Branc h",
      "[ S",
      "[S ]",
      "F ]",
      "[ F]",
      "[#Branch 1]",
      "O ]",
      "[# C]",
      "[ C",
      "[ P",
      "[P ]",
      "[#Branch 2",
      "[#Branch2 ]",
      "= Ring1]",
      "[ =Ring1]",
      "[ N",
      "l ]",
      "[C l]",
      "[N H1]",
      "h 1]",
      "c h1]",
      "n ch1]",
      "a nch1]",
      "r anch1]",
      "B ranch1]",
      "[ Branch1]",
      "@ ]",
      "[C @]",
      "[C@@ ]",
      "[ N]",
      "= B",
      "[ =B",
      "[=B r",
      "[=Br a",
      "[=Bra n",
      "[=Bran c",
      "[=Branc h",
      "[=Branch 2",
      "[=Branch2 ]",
      "r ]",
      "B r]",
      "[ Br]",
      "[ /",
      "[/ C]",
      "[# N]",
      "= Ring2]",
      "[ =Ring2]",
      "+ 1]",
      "- 1]",
      "[O -1]",
      "[N +1]",
      "= N",
      "[ =N",
      "[=N +1]",
      "I ]",
      "[ I]",
      "[=N -1]",
      "= S",
      "[ =S",
      "[S @]",
      "@@ ]",
      "[=S ]",
      "[S @@]",
      "[N -1]",
      "[S i",
      "[Si ]",
      "[/ C@H1]",
      "[/ C",
      "[/C l]",
      "[/ C@@",
      "[/C@@ H1]",
      "[S +1]",
      "[=S @]",
      "[=S @@]",
      "B ]",
      "[ B]",
      "[/ Br]",
      "[/ S",
      "[/S ]",
      "[P @]",
      "[/ F]",
      "[P @@]",
      "[N @]",
      "[/ N]",
      "[/ O]",
      "N +1]",
      "[/ N+1]",
      "[N @@]",
      "1 +1]",
      "H 1+1]",
      "P ]",
      "= P]",
      "[ =P]",
      "[/ I]",
      "B -1]",
      "[ B-1]",
      "[N H1+1]",
      "[N H",
      "[N @@",
      "[N@@ H1+1]",
      "2 +1]",
      "[NH 2+1]",
      "[N @",
      "[N@ H1+1]",
      "0 ]",
      "H 0]",
      "[O H0]",
      "3 +1]",
      "[NH 3+1]",
      "[P H1]",
      "[Si @]",
      "[Si @@]",
      "[/S @@]",
      "[=N H1+1]",
      "[N@ +1]",
      "[/S @]",
      "[N@@ +1]",
      "n ]",
      "[S n]",
      "[/ P]",
      "e ]",
      "[=S e]",
      "l -1]",
      "[C l-1]",
      "[# N+1]",
      "H 2+1]",
      "[=N H2+1]",
      "[/C @]",
      "= P",
      "[ =P",
      "[C -1]",
      "[C H0]",
      "[=S +1]",
      "[NH 0]",
      "@@ +1]",
      "[S @@+1]",
      "[=P @@]",
      "[=N H0]",
      "[=P @]",
      "O +1]",
      "= O+1]",
      "O -1]",
      "[ =O+1]",
      "@@ H1]",
      "[/ O-1]",
      "[Si @H1]",
      "[/C@@ ]",
      "i ]",
      "[O +1]",
      "[S H1]",
      "[P +1]",
      "[P @@H1]",
      "[=S H1]",
      "[Si @@H1]",
      "[/S i]"
    ]
  }
}