{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "Regex": "(\\[[^\\]]+]|Br?|Cl?|N|O|S|P|F|I|b|c|n|o|s|p|\\(|\\)|\\.|=|#|-|\\+|\\\\\\\\|\\/|:|~|@|\\?|>>?|\\*|\\$|\\%[0-9]{2}|[0-9])"
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<bos>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<eos>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<bos>": {
        "id": "<bos>",
        "ids": [
          3
        ],
        "tokens": [
          "<bos>"
        ]
      },
      "<eos>": {
        "id": "<eos>",
        "ids": [
          2
        ],
        "tokens": [
          "<eos>"
        ]
      }
    }
  },
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "</w>"
  },
  "model": {
    "type": "BPE",
    "dropout": 0.1,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<unk>": 0,
      "<pad>": 1,
      "<bos>": 2,
      "<eos>": 3,
      "#": 4,
      "%": 5,
      ")": 6,
      "+": 7,
      "-": 8,
      ".": 9,
      "/": 10,
      "0": 11,
      "1": 12,
      "2": 13,
      "3": 14,
      "4": 15,
      "5": 16,
      "6": 17,
      "7": 18,
      "8": 19,
      "9": 20,
      "=": 21,
      "@": 22,
      "B": 23,
      "C": 24,
      "F": 25,
      "H": 26,
      "I": 27,
      "N": 28,
      "O": 29,
      "P": 30,
      "S": 31,
      "[": 32,
      "]": 33,
      "c": 34,
      "e": 35,
      "i": 36,
      "l": 37,
      "n": 38,
      "o": 39,
      "r": 40,
      "s": 41,
      "@@": 42,
      "C@@": 43,
      "[C@@": 44,
      "[C@@H": 45,
      "[C@@H]": 46,
      "Cl": 47,
      "[n": 48,
      "[nH": 49,
      "[nH]": 50,
      "@]": 51,
      "C@]": 52,
      "[C@]": 53,
      "[C@@]": 54,
      "Br": 55,
      "%1": 56,
      "%10": 57,
      "[N": 58,
      "+]": 59,
      "-]": 60,
      "[N+]": 61,
      "[O": 62,
      "[O-]": 63,
      "[S": 64,
      "[N-]": 65,
      "[S@]": 66,
      "@@]": 67,
      "[S@@]": 68,
      "[n+]": 69,
      "%11": 70,
      "[Si": 71,
      "[Si]": 72,
      "%13": 73,
      "[S+]": 74,
      "%14": 75,
      "%12": 76,
      "[P": 77,
      "[P@]": 78,
      "[P@@]": 79,
      "[N@]": 80,
      "%15": 81,
      "[N@@]": 82,
      "%2": 83,
      "H+]": 84,
      "%18": 85,
      "%17": 86,
      "B-]": 87,
      "[B-]": 88,
      "%16": 89,
      "%19": 90,
      "%20": 91,
      "[NH+]": 92,
      "[NH": 93,
      "[N@@": 94,
      "[N@@H+]": 95,
      "2+]": 96,
      "[NH2+]": 97,
      "%21": 98,
      "[N@": 99,
      "[N@H+]": 100,
      "%22": 101,
      "[O]": 102,
      "3+]": 103,
      "[NH3+]": 104,
      "[PH": 105,
      "[PH]": 106,
      "%23": 107,
      "%24": 108,
      "[Si@]": 109,
      "[Si@@]": 110,
      "[n-]": 111,
      "[N@+]": 112,
      "[nH+]": 113,
      "%26": 114,
      "[N@@+]": 115,
      "n]": 116,
      "[Sn]": 117,
      "[s": 118,
      "[s+]": 119,
      "%25": 120,
      "e]": 121,
      "[Se]": 122,
      "[Cl": 123,
      "[Cl-]": 124,
      "%27": 125,
      "%28": 126,
      "[N]": 127,
      "C]": 128,
      "C-]": 129,
      "[C]": 130,
      "[C-]": 131,
      "@@+]": 132,
      "[S@@+]": 133,
      "@@H": 134,
      "[O+]": 135,
      "[SH": 136,
      "[Si@": 137,
      "%29": 138,
      "@@H]": 139,
      "[SH]": 140,
      "[Si@H": 141,
      "[Si@H]": 142,
      "[c": 143,
      "[o": 144,
      "[Si@@H]": 145,
      "[P+]": 146,
      "[P@@H]": 147,
      "[NH]": 148,
      "[c-]": 149,
      "[o+]": 150
    },
    "merges": [
      "@ @",
      "C @@",
      "[ C@@",
      "[C@@ H",
      "[C@@H ]",
      "C l",
      "[ n",
      "[n H",
      "[nH ]",
      "@ ]",
      "C @]",
      "[ C@]",
      "[C@@ ]",
      "B r",
      "% 1",
      "%1 0",
      "[ N",
      "+ ]",
      "- ]",
      "[N +]",
      "[ O",
      "[O -]",
      "[ S",
      "[N -]",
      "[S @]",
      "@@ ]",
      "[S @@]",
      "[n +]",
      "%1 1",
      "[S i",
      "[Si ]",
      "%1 3",
      "[S +]",
      "%1 4",
      "%1 2",
      "[ P",
      "[P @]",
      "[P @@]",
      "[N @]",
      "%1 5",
      "[N @@]",
      "% 2",
      "H +]",
      "%1 8",
      "%1 7",
      "B -]",
      "[ B-]",
      "%1 6",
      "%1 9",
      "%2 0",
      "[N H+]",
      "[N H",
      "[N @@",
      "[N@@ H+]",
      "2 +]",
      "[NH 2+]",
      "%2 1",
      "[N @",
      "[N@ H+]",
      "%2 2",
      "[O ]",
      "3 +]",
      "[NH 3+]",
      "[P H",
      "[PH ]",
      "%2 3",
      "%2 4",
      "[Si @]",
      "[Si @@]",
      "[n -]",
      "[N@ +]",
      "[nH +]",
      "%2 6",
      "[N@@ +]",
      "n ]",
      "[S n]",
      "[ s",
      "[s +]",
      "%2 5",
      "e ]",
      "[S e]",
      "[ Cl",
      "[Cl -]",
      "%2 7",
      "%2 8",
      "[N ]",
      "C ]",
      "C -]",
      "[ C]",
      "[ C-]",
      "@@ +]",
      "[S @@+]",
      "@@ H",
      "[O +]",
      "[S H",
      "[Si @",
      "%2 9",
      "@@H ]",
      "[SH ]",
      "[Si@ H",
      "[Si@H ]",
      "[ c",
      "[ o",
      "[Si @@H]",
      "[P +]",
      "[P @@H]",
      "[NH ]",
      "[c -]",
      "[o +]"
    ]
  }
}